[{"title":"After Dark in Central Park","year":1900,"description":"At the opening of this picture, a couple are seen in dim outlines, spooning on a park bench. In comes a policeman, armed with a dark-lantern, which he suddenly flashes on the couple. They ...","rating":"4.2","poster":"N/A"},{"title":"Boarding School Girls' Pajama Parade","year":1900,"description":"N/A","rating":"4.4","poster":"N/A"},{"title":"Buffalo Bill's Wild West Parad","year":1900},{"title":"Caught","year":1900,"description":"N/A","rating":"3.6","poster":"N/A"},{"title":"Clowns Spinning Hats","year":1900,"description":"This film shows two clowns performing acrobatic feats and finally separating to a distance of about thirty feet. They spin their large clown hats one to the other, catching them on their ...","rating":"N/A","poster":"N/A"},{"title":"Capture of Boer Battery by British","year":1900,"description":"Nothing can exceed the stubborn resistance shown by the Gordon Highlanders, as we see them steadily advancing in the face of a murderous fire of the Boers, who are making their guns speak ...","rating":"4.7","poster":"N/A"},{"title":"The Enchanted Drawing","year":1900,"description":"A cartoonist defies reality when he draws objects that become three-dimensional after he lifts them off his sketch pad.","rating":"7.0","poster":"https://m.media-amazon.com/images/M/MV5BZGEzZTQ4YjctZThlZi00ODIxLWJjNzctYjliMzc1YTE2ZjFiXkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_SX300.jpg"},{"title":"Feeding Sea Lions","year":1900,"description":"Here is a decided novelty. Sea lions are not to be seen every day, and it is your privilege to show about 12 in number, being fed by their trainer, Capt. Paul Boynton. After feeding them on...","rating":"N/A","poster":"N/A"},{"title":"How to Make a Fat Wife Out of Two Lean Ones","year":1900,"description":"N/A","rating":"4.2","poster":"N/A"},{"title":"New Life Rescue","year":1900,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"New Morning Bath","year":1900,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Searching Ruins on Broadway, Galveston, for Dead Bodies","year":1900,"description":"This shows the heart of the tremendous drifts in the east end of Galveston. Hundreds of bodies are concealed in these immense masses, and at the time the picture was taken the odor given ...","rating":"4.9","poster":"N/A"},{"title":"Sherlock Holmes Baffled","year":1900,"description":"Sherlock Holmes enters his drawing room to find it being burgled, but on confronting the villain is surprised when the latter disappears. Holmes initially attempts to ignore the event by ...","rating":"5.1","poster":"https://m.media-amazon.com/images/M/MV5BMGVlMTZmNmQtZGJhZS00MTY5LThjNjItMjVmYWE3ODlkNjc1XkEyXkFqcGdeQXVyNzg5OTk2OA@@._V1_SX300.jpg"},{"title":"The Tribulations of an Amateur Photographer","year":1900,"description":"N/A","rating":"4.2","poster":"N/A"},{"title":"Trouble in Hogan's Alley","year":1900,"description":"N/A","rating":"4.0","poster":"N/A"},{"title":"Two Old Sparks","year":1900,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Wonder, Ching Ling Foo","year":1900,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Watermelon Contest","year":1900,"description":"Four men each hold a large slice of watermelon, and have a race to see who can finish eating first. All four move quickly, but one man seems to be pulling ahead of the others. Soon the contestants begin to hinder one another's efforts.","rating":"3.8","poster":"N/A"},{"title":"Acrobats in Cairo","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"An Affair of Honor","year":1901,"description":"Two women engage in a sword fight.","rating":"N/A","poster":"N/A"},{"title":"Another Job for the Undertaker","year":1901,"description":"Shows a bedroom in a hotel. On the wall of the room is a conspicuous sign \"Don't blow out the gas.\" A hayseed enters the room, accompanied by a bellboy. The boy deposits the Rube's bag and ...","rating":"5.1","poster":"N/A"},{"title":"Arrival of Tongkin Train","year":1901,"description":"Showing the arrival of a Chinese passenger train at the station.","rating":"4.7","poster":"N/A"},{"title":"The Artist's Dilemma","year":1901,"description":"The scene opens in an artist's studio, the artist asleep in his chair. A large old fashioned clock opens and a young lady comes out and awaking the artist, requests him to paint her picture...","rating":"6.2","poster":"N/A"},{"title":"Band and Battalion of the U.S. Indian School","year":1901,"description":"A parade drill by the cadet corps at the United States Indian School, composed of representatives of all the aboringinal tribes of North America, headed by the famous Carlisle Band, which ...","rating":"N/A","poster":"N/A"},{"title":"Barnum and Bailey's Circus","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Beef Extract Room","year":1901,"description":"N/A","rating":"7.4","poster":"N/A"},{"title":"Boxing in Barrels","year":1901,"description":"A Hayseed and a clown jump into barrels and have a boxing bout. The clown knocks the countryman down, who is again assisted to his feet by an onlooker. The clown throws him down again, ...","rating":"N/A","poster":"N/A"},{"title":"Branding Hams","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Buffalo Street Parade","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Busy Corner at Armour's","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Bund, Shanghai","year":1901,"description":"A scene on the Bund, the leading business street of the English quarter, Shanghai.","rating":"N/A","poster":"N/A"},{"title":"Circular Panorama of the Base of the Electric Tower, Ending Looking Down the Mall","year":1901,"description":"In recording this picture, the camera was stationed in the centre of the Court of Fountains, which is between the Cascades and the Grand Basin. The scene begins with the lens looking toward...","rating":"N/A","poster":"N/A"},{"title":"Circular Panorama of the Electric Tower and Pond","year":1901,"description":"Here we show a close view of the Electric Tower with its statuary and fountains.","rating":"N/A","poster":"N/A"},{"title":"Circular Panorama of the Esplanade with the Electric Tower in the Background","year":1901,"description":"The camera is stationed in the center of the Pan-American Esplanade near the west fountain band stand, and looking toward the Horticultural Building. The film was put in motion and the ...","rating":"N/A","poster":"N/A"},{"title":"Coaling a Steamer, Nagasaki Bay, Japan","year":1901,"description":"A splendid picture showing a crowd of Coolie men and women coaling a big ocean-going steamer by means of hand baskets passed from one to another.","rating":"N/A","poster":"N/A"},{"title":"Convention of Railroad Passengers","year":1901,"description":"A portrait study of the party of distinguished men attending the annual convention.","rating":"N/A","poster":"N/A"},{"title":"Cornell-Columbia-University of Pennsylvania Boat Race at Ithaca, N.Y., Showing Lehigh Valley Observation Train","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Couchee Dance on the Midway","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Donkey Party","year":1901,"description":"Shows a large picture of a donkey hanging on the wall in a parlor. Five pretty girls and Grandma participate in the game. Each player in turn, while blindfolded, endeavors to attach the ...","rating":"N/A","poster":"N/A"},{"title":"The Finish of Bridget McKeen","year":1901,"description":"The cook has trouble lighting the stove, so she adds kerosene, with explosive results.","rating":"5.5","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTcyMzRkMWUtMmZjMS00NGY5LTg5NGEtNjdmMjUzOTY4Y2NmXkEyXkFqcGdeQXVyMDM0MzU2NA@@._V1_SX300.jpg"},{"title":"Follow the Leader","year":1901,"description":"Shows six young ladies in a dormitory. One goes to a table and procures five plates. The bottoms are smeared with soot, which is not known to the participants in the game. The leader's own ...","rating":"N/A","poster":"N/A"},{"title":"The Fraudulent Beggar","year":1901,"description":"A supposed blind man stands on the corner asking alms. An officer passes by and orders him off. He strikes the guardian of the peace, and throwing down his crutch, runs off. The policeman ...","rating":"N/A","poster":"N/A"},{"title":"Fun at a Children's Party","year":1901,"description":"Here is one to please the children. A group of bright young girls are each supplied with a plate in each of which the eldest girl pours some water. She seats herself on a chair surrounded ...","rating":"N/A","poster":"N/A"},{"title":"A Good Joke","year":1901,"description":"In which are seen three typical southern darkies each of which is over 90 years of age. One is engaged...","rating":"N/A","poster":"N/A"},{"title":"The Gordon Sisters Boxing","year":1901,"description":"The scene is a theatre stage with a painted panorama of French garden, with a central alley between lawns, with a couple of marble steps and balcony in front, and a line of trees in the ...","rating":"4.7","poster":"N/A"},{"title":"Grand Entry, Indian Congress","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Happy Hooligan April-Fooled","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Happy Hooligan Surprised","year":1901,"description":"Four boys are shooting craps on the sidewalk just outside of a saloon. A genial Dutch bartender appears and shows the boys a new trick, which consists in placing an ordinary tin funnel in ...","rating":"N/A","poster":"N/A"},{"title":"Harbor of Shanghai","year":1901,"description":"A running panorama of the harbor of Shanghai showing the shipping, native boats, and shore line.","rating":"N/A","poster":"N/A"},{"title":"A Hold-Up","year":1901,"description":"Two tramps lie in wait behind a tree and a dude approaches. They make him disrobe and place him in a barrel. The swell tries to run away, but is overtaken by a policeman, who locks him up. Good.","rating":"N/A","poster":"N/A"},{"title":"Ice-Boat Racing at Redbank, N.J.","year":1901,"description":"An American flag acts as a stake in the race, and is placed in the center of the ice. The yachts with their great white sails are seen running toward and rounding the stake. They go through...","rating":"N/A","poster":"N/A"},{"title":"Indians No. 1","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Jeffries and Ruhlin Sparring Contest at San Francisco, Cal., November 15, 1901","year":1901,"description":"On the night of November 15, 1901, James J. Jeffries, of Los Angeles, California, and Gus Ruhlin, of Akron, Ohio, engaged in a sparring contest in the ring of the Twentieth Century Athletic...","rating":"4.7","poster":"N/A"},{"title":"A Joke on Grandma","year":1901,"description":"Shows the old familiar game, \"Hoist the Sail,\" played on an unsuspecting Grandma. Grandma is seated in a big chair, with her six charming granddaughters gathered about her. They stand over ...","rating":"N/A","poster":"N/A"},{"title":"Kansas Saloon Smashers","year":1901,"description":"Reenactment of Carrie Nation's saloon smashing in Wichita.","rating":"4.9","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2Q1YmY5M2MtZWMwYi00MjExLWFlOWUtZGY1YTQxYWNjZTk4XkEyXkFqcGdeQXVyMDM1MzIyMQ@@._V1_SX300.jpg"},{"title":"Launching of the New Battleship 'Ohio' at San Francisco, Cal. When President McKinley Was There","year":1901,"description":"The U.S. Battleship \"Ohio\" was launched from the wharfs of the Union Iron Works at San Francisco, Cal. Our photographers were sent to San Francisco and were on hand to catch a picture of ...","rating":"N/A","poster":"N/A"},{"title":"Laura Comstock's Bag-Punching Dog","year":1901,"description":"This wonderful dog \"Mannie,\" owned by the vaudeville star, Miss Laura Comstock, is a most learned animal. He has been trained to perform all sorts of tricks, and his intelligence is, ...","rating":"4.4","poster":"N/A"},{"title":"The Life of a Fireman","year":1901,"description":"Firemen sit in front of the firehouse. When the alarm goes off, they rush to their places on the fire apparatus.","rating":"5.0","poster":"N/A"},{"title":"Love by the Light of the Moon","year":1901,"description":"Shows a garden wall in the background. Two lovers appear and lean over the garden gate where the moon throws a shadow upon the ground. The young man invites the young lady to a settee, when...","rating":"5.1","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTI3MzI0Nl5BMl5BanBnXkFtZTcwMzQ1MTYzMw@@._V1_SX300.jpg"},{"title":"The Martyred Presidents","year":1901,"description":"This film is difficult to classify. It opens on a scene showing a mourner with bowed head sitting in front of what appears to be a tombstone. Shortly afterwards, the face of Abraham Lincoln...","rating":"3.7","poster":"N/A"},{"title":"Midway Dance","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Miles Canyon Tramway","year":1901,"description":"This primitive railway made of rough logs shows one of the means adopted by the miners in conveying supplies in a new country. Each car, as it approaches, can be seen as it passes to be ...","rating":"6.0","poster":"N/A"},{"title":"Montreal Fire Department on Runners","year":1901,"description":"First comes the Chief's sleigh with old-fashioned side runners, containing the Chief and his driver. Next comes a chemical engine mounted on a stout double runner sled, which is followed ...","rating":"4.4","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2I4NzVjOWQtYzg0NC00NmZhLWE1YmEtNDQxYWFiNGE5ZTc5XkEyXkFqcGdeQXVyNzg5OTk2OA@@._V1_SX300.jpg"},{"title":"Mounted Police Charge","year":1901,"description":"The same subject as MOUNTED POLICE, excepting that they are seen to charge on horseback.","rating":"N/A","poster":"N/A"},{"title":"The Old Maid Having Her Picture Taken","year":1901,"description":"An old maid is walking about the studio while the photographer is getting his camera ready. She first looks at a hanger, which immediately falls from the wall, not being able to stand her ...","rating":"4.8","poster":"https://m.media-amazon.com/images/M/MV5BN2VlYWRkZjktNWI5NC00MDMzLWExMGItMWQ2ZDYzYjUwNGU2XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SX300.jpg"},{"title":"Opening of the Pan-American Exposition Showing Vice President Roosevelt Leading the Procession","year":1901,"description":"This is a great historical event. Our cameras were stationed in the center of the Esplanade looking toward the Main Approach to the Pan-American Exposition, with the Triumphal Bridge, and ...","rating":"4.3","poster":"https://m.media-amazon.com/images/M/MV5BNDQ0MDIyNjItNmZlOC00ZjQzLTkwMGUtNzUxZjM0OTgwMjI3XkEyXkFqcGdeQXVyNzg5OTk2OA@@._V1_SX300.jpg"},{"title":"Pan-American Exposition by Night","year":1901,"description":"A great feature of the Pan-American Exposition, as unanimously conceded by all visitors, was the electric illumination of the Exposition grounds at night. After a great deal of ...","rating":"5.8","poster":"https://m.media-amazon.com/images/M/MV5BNjcwODE5NWUtZjRiYi00OGFjLWI0YjQtM2E5MzM1OWQ4M2I1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SX300.jpg"},{"title":"Panorama of the Exposition, No. 1","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Panorama of the Exposition, No. 2","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Panoramic View of the Fleet After Yacht Race","year":1901,"description":"In this picture we secured a most perfect panoramic scene of the war vessels, official tugs and excursion steamers starting for home immediately after the race. The boats were all under ...","rating":"N/A","poster":"N/A"},{"title":"Panoramic View of the Temple of Music and Esplanade","year":1901,"description":"This picture was taken especially to give a detailed view of the Temple of Music, the Esplanade and exquisite statuary which is clustered directly in front of the cascades. As the camera ...","rating":"N/A","poster":"N/A"},{"title":"Panoramic View, Asheville, N.C.","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Le Petit chaperon rouge","year":1901},{"title":"Photographing the Audience","year":1901,"description":"A photographer on the stage attempts to photograph the audience and is almost driven wild by those who will not pose correctly. Finally he snaps the camera in despair, but it explodes and ...","rating":"N/A","poster":"N/A"},{"title":"Pie, Tramp and the Bulldog","year":1901,"description":"This we believe to be one of the funniest pictures ever put on exhibition. It has had a run of five weeks at Proctor's New York Vaudeville Theatres and the audiences never seemed to tire of...","rating":"N/A","poster":"N/A"},{"title":"President McKinley and Escort Going to the Capitol","year":1901,"description":"Short film which documents President McKinley's escort to the Capitol building.","rating":"4.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTczNDQxMjctY2M5YS00ODI2LTliMTAtYzg3M2QxNzM0NDc3XkEyXkFqcGdeQXVyMTEzNzczMA@@._V1_SX300.jpg"},{"title":"President McKinley Taking the Oath","year":1901,"description":"Short film which documents William McKinley's presidential inauguration.","rating":"4.4","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzQxYzVjODItMjgyYS00MjEwLWJjYzQtYTlhNWQ4MzlkOGYxL2ltYWdlXkEyXkFqcGdeQXVyMDM0MzU2NA@@._V1_SX300.jpg"},{"title":"President McKinley's Speech at the Pan-American Exposition","year":1901,"description":"In this picture we present a wonderful and life-like likeness of President McKinley. He first walks upon the platform, escorting Mrs. McKinley, whom he very reverently shows to a seat. The ...","rating":"4.2","poster":"N/A"},{"title":"The Queen's Funeral","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Le Rêve de Noël","year":1901},{"title":"Rocking Gold in the Klondike","year":1901,"description":"Here we see one of the methods employed in the search for gold, where water is scarce. We see the workmen using the water over and over again in the rocker until it becomes too thick with ...","rating":"4.1","poster":"N/A"},{"title":"Ruhlin in His Training Quarters","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Shad Fishing at Gloucester, N.J.","year":1901,"description":"This picture is one that is truly interesting and portrays the shad fishing industry below Gloucester City, N.J., on the Delaware. To many who have never seen how shad are caught it will ...","rating":"N/A","poster":"N/A"},{"title":"Terrible Teddy, the Grizzly King","year":1901,"description":"Theodore Roosevelt merrily kills a mountain lion in Colorado while his press agent and photographer record the event for posterity.","rating":"4.0","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTI3MzI0Nl5BMl5BanBnXkFtZTcwMzQ1MTYzMw@@._V1_SX300.jpg"},{"title":"The Tramp's Dream","year":1901,"description":"Shows the moon rising above the trees and Weary Willie approaching a bench. After yawning and stretching he lies down to sleep. He begins a dream. The scene changes to the back door of a ...","rating":"5.2","poster":"N/A"},{"title":"Tramp's Nap Interrupted","year":1901,"description":"Two tramps meet on the railroad, and after shaking hands one departs, leaving the other in the center of the track, who seats himself on one of the ties and proceeds to eat his mid-day ...","rating":"N/A","poster":"N/A"},{"title":"Trapeze Disrobing Act","year":1901,"description":"Shows the stage of a vaudeville theatre. A lady in evening costume is performing on a trapeze. Two Rubes are seated in a box. The lady begins to disrobe, and here the fun commences. As she ...","rating":"5.7","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzc0MTI4ODItMjU3MS00ZWVlLWI0OWMtNTU5MDBlOTk3YjcwXkEyXkFqcGdeQXVyMDM1MzIyMQ@@._V1_SX300.jpg"},{"title":"A Trip Around the Pan-American Exposition","year":1901,"description":"The Pan-American Exposition is encircled by an especially constructed canal, which was put in for the purpose of allowing the tourist to view the exterior of the buildings of the ...","rating":"4.5","poster":"N/A"},{"title":"Turkish Dance","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Twelve in a Barrel","year":1901,"description":"Twelve girls stand in a row according to size. A magician displays an empty flour barrel to his audience. He then calls each girl to him, beginning at the eldest, and as she steps upon the ...","rating":"N/A","poster":"N/A"},{"title":"Two Rubes at the Theatre","year":1901,"description":"This picture shows the interior of a well-known theatre. Two hayseeds occupy the front seats and an idea can be gained of the merits of the play by their facial expressions. They indulge in...","rating":"5.0","poster":"N/A"},{"title":"Upper Falls of the Yellowstone","year":1901,"description":"This picture shows this celebrated spectacle of nature in the highest state of its grandeur. As this immense volume of angry water falls from its dizzy height, clearly defined against its ...","rating":"N/A","poster":"N/A"},{"title":"Washing Gold on 20 Above Hunker, Klondike","year":1901,"description":"This picture shows the miners washing out gold by what is known as the sluice box method. Here we see the miners shovelling from both sides the soil containing the gold into the sluice ...","rating":"5.8","poster":"N/A"},{"title":"Wedding Procession in Cairo","year":1901,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Why Mr. Nation Wants a Divorce","year":1901,"description":"The scene opens in the bedroom of Mr. Nation, husband of the famous Carrie Nation, the \"Kansas Saloon Smasher.\" Mr. Nation suddenly arises from the bed and picks up a crying infant from the...","rating":"4.8","poster":"N/A"},{"title":"Wonderful Trick Donkey, The","year":1901},{"title":"Yacht Race Fleet Following the Committee Boat 'Navigator' Oct. 4th, The","year":1901},{"title":"You Can't Lose Your Mother-in-Law","year":1901,"description":"After reading the description of this film, the bald heads in the front row will subscribe to the title of this film. A fast train is seen approaching in the distance and after rounding a ...","rating":"N/A","poster":"N/A"},{"title":"Arrival of Prince Henry (of Prussia) and President Roosevelt at Shooter's Island (1902)","year":1902},{"title":"The Burlesque Suicide, No. 2","year":1902,"description":"A despondent-looking man sits behind a table that holds a drink and a gun. He hesitates, thinks things over, starts to take a drink, and then puts down the glass. Then he picks up the gun, raises it to his temple, and ...","rating":"4.8","poster":"N/A"},{"title":"Burning of Durland's Riding Academy","year":1902,"description":"This picture shows the fire at its height, the firemen playing water on the buildings, and the falling walls of one of the large stones. - from the Edison Catalog","rating":"5.2","poster":"N/A"},{"title":"The Interrupted Bathers","year":1902,"description":"Three girls are taking a bath in a quiet, shady spot along a beautiful stream. Another young lady in bathing attire reclines on the bank. The latter suddenly discovers two hoboes coming ...","rating":"4.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGI3OTg1OTAtMTA5NC00YTg3LThhMDMtMTJjMGFjY2I2OTcyXkEyXkFqcGdeQXVyMDM1MzIyMQ@@._V1_SX300.jpg"},{"title":"Jack and the Beanstalk","year":1902,"description":"Porter's sequential continuity editing links several shots to form a narrative of the famous fairy tale story of Jack and his magic beanstalk. Borrowing on cinematographic methods ...","rating":"6.2","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTI3MzI0Nl5BMl5BanBnXkFtZTcwMzQ1MTYzMw@@._V1_SX300.jpg"},{"title":"Who Said Watermelon?","year":1902,"description":"The usual watermelon picture shows darkey men eating the luscious fruit. We have an excellent one of that kind of which we have sold quite a number, but the demand for new watermelon ...","rating":"N/A","poster":"N/A"},{"title":"Snow White","year":1902,"description":"N/A","rating":"4.8","poster":"N/A"},{"title":"After Dark; or, the Policeman and His Lantern","year":1903},{"title":"Alice in Wonderland","year":1903,"description":"Alice dozes in a garden, awakened by a dithering white rabbit in waistcoat with pocket watch. She follows him down a hole and finds herself in a hall of many doors. A key opens a small door...","rating":"6.3","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQyZWYxZWYtNDRmZC00ZjQxLTlhZGQtM2JmZGNlYjViNGU5XkEyXkFqcGdeQXVyNDk0MDg4NDk@._V1_SX300.jpg"},{"title":"An Up-to-Date Studio","year":1903,"description":"An operator takes the scene of a photographer flirting with a dancer.","rating":"N/A","poster":"N/A"},{"title":"A Visit to the Zoo","year":1903,"description":"Animals are always interesting to look upon, especially those which are not seen daily. Here we show the American Eagle, the long-necked Giraffe, the Zebra, and a number of others, ...","rating":"N/A","poster":"N/A"},{"title":"At Work in a Peat Bog","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Automobile Explosion","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Ascent of Mont Blanc","year":1903},{"title":"Bicycle Dive","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Bloodhounds Tracking a Convict","year":1903},{"title":"Buying a Baby","year":1903,"description":"A newly married couple desiring a baby, visit a doll shop and after looking over the large dolls, decide that they want a genuine baby. The attendant, seeing that her prospective customers ...","rating":"N/A","poster":"N/A"},{"title":"Cliff Scenery at the Fabbins","year":1903,"description":"A series of pictures illustrating the extraordinary beautiful coast scenery at this spot, with numerous tourists passing over the bridge spanning the chasms. The rough sea lends variety to ...","rating":"N/A","poster":"N/A"},{"title":"Close Quarters, with a Notion of the Motion of the Ocean","year":1903,"description":"A couple try to dress in the cabin of a rolling ship.","rating":"N/A","poster":"N/A"},{"title":"Cruelty on the High Seas","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Coach Drive from Glengariffe to Kenmore","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Discovered Through an Opera Glass","year":1903,"description":"This is a good one. A beautiful young lady observes a crowd in the distance and, seizing her opera glasses, scans the crowd over to see if her lover is among them. Catching his eye, she ...","rating":"N/A","poster":"N/A"},{"title":"A Drove of Wild Welsh Mountain Ponies","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Delhi Camp Railway","year":1903},{"title":"DeVoy's Revolving Ladder Act","year":1903,"description":"Everybody knows the famous DeVoy, but everyone has not seen his wonderful act, and here is the opportunity. It is nothing short of the marvelous, and you hold your breath while he is ...","rating":"N/A","poster":"N/A"},{"title":"The Deserter","year":1903,"description":"This film tells a pathetic story of a soldier who has received a telegram telling him that if he wishes to see his father alive he must come at once. The soldier asks permission to leave ...","rating":"N/A","poster":"N/A"},{"title":"The Effects of a Trolley Car Collision","year":1903,"description":"Every person who has ridden in a trolley car knows what it is to be jostled about by the standing crowd, but if you want to see the effects of a collision when everybody is standing, buy this film. It is a good one from start to finish.","rating":"N/A","poster":"N/A"},{"title":"Firemen to the Rescue","year":1903,"description":"Six scenes: A child knocks clothes into fire; alarm at station; engines emerge; engines rush down street; arrival; fireman breaks through wall and saves child.","rating":"N/A","poster":"N/A"},{"title":"The Goose Takes a Trolley Ride","year":1903,"description":"The picture opens showing the approach of a Philadelphia trolley car, known as refrigerator cars in winter. The car stops and a lady gets aboard. Just before the car starts, a farmer hops ...","rating":"N/A","poster":"N/A"},{"title":"Egyptian Fakir with Dancing Monkey","year":1903,"description":"The fakir with his trick monkey is seated on the pavement in a street in Cairo. He plays a tom-tom, while the monkey dances the couchee-couchee. The movements of the monkey are very comical...","rating":"5.1","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg3MzZkNTAtNWI3ZC00YWYzLWFhZDctZjVlMDJkNTlhZDA1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SX300.jpg"},{"title":"Electrocuting an Elephant","year":1903,"description":"The execution of Topsy, a female elephant, in a publicity stunt advertising the opening of Luna Park on Coney Island. Topsy was originally owned by Forepaugh Circus where she killed a ...","rating":"3.2","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODViNTAyZmMtZDMxZS00Zjc4LWFmNjUtNjA4OTY2ZDExNjJjXkEyXkFqcGdeQXVyNDk0MDg4NDk@._V1_SX300.jpg"},{"title":"English Barnyard Scene","year":1903,"description":"A beautiful country scene in which a man and a beautiful maiden are seen feeding the chickens and ducks. The figures are large and clearly discerned and the entire view is picturesque and unique.","rating":"N/A","poster":"N/A"},{"title":"Every Day Is Sunshine When the Heart Beats True","year":1903,"description":"N/A","rating":"7.0","poster":"N/A"},{"title":"Fire!","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Fife Getting Instructions from Committee","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Fun on Board a Fishing Smack","year":1903,"description":"The upper deck of a large fishing smack is plainly in view and on which a number of fishermen are seen to sort the fish. Suddenly one of their number turns on the hose and they engage in a ...","rating":"N/A","poster":"N/A"},{"title":"The Great Train Robbery","year":1903,"description":"A group of bandits stage a brazen train hold-up, only to find a determined posse hot on their heels.","rating":"7.3","poster":"https://m.media-amazon.com/images/M/MV5BMTU3NjE5NzYtYTYyNS00MDVmLWIwYjgtMmYwYWIxZDYyNzU2XkEyXkFqcGdeQXVyNzQzNzQxNzI@._V1_SX300.jpg"},{"title":"Hop Picking","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"How to Shut Up a Quarrelsome Wife","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Light Heavyweight Championship Contest Between Root and Gardner","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Little Tich and His Funny Feet","year":1903},{"title":"Murder Scene from 'King of the Detectives'","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Moses in the Bullrushes","year":1903,"description":"This is altogether a remarkable subject, handled in such a high-class way as to make it an extremely appropriate subject for exhibitors who make a specialty of church and lyceum work. A ...","rating":"N/A","poster":"N/A"},{"title":"Murphy's Wake","year":1903,"description":"An Irishman pretends to die in a fight and revives at the wake.","rating":"N/A","poster":"N/A"},{"title":"New York Harbor Police Boat Patrol Capturing Pirates","year":1903,"description":"The \"Patrol\" is seen chasing a row-boat containing river pirates. The pirates are pulling at the oars with all their strength, but a few shots from the Police Boat weaken their nerves and ...","rating":"4.0","poster":"N/A"},{"title":"Nicholas Nickleby","year":1903,"description":"An ignorant teacher beats a pupil and is caned by his new assistant.","rating":"N/A","poster":"N/A"},{"title":"Old Irish Cabin","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"On the Bow River Horse Ranch at Cochrane, North West Territory","year":1903},{"title":"Only a Soldier Boy","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Our New Cook","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Over the Garden Wall","year":1903},{"title":"Panorama of the Lakes of Killarney from Hotel","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Passengers Embarking from S.S. Augusta Victoria, at Beyrouth","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Pigeons, Place St. Marc, Venice","year":1903,"description":"N/A","rating":"5.7","poster":"N/A"},{"title":"Pittsburgh Fire Department in Full Run","year":1903,"description":"This picture was taken on a bright, sunshiny day, and is beautifully sharp. It shows six of the fire apparatus used in Pittsburg, Pa., including those that are drawn by three horses abreast...","rating":"N/A","poster":"N/A"},{"title":"Polo Match for the Championship at Hurlingham","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Puzzled Bather and His Animated Clothes","year":1903},{"title":"Quarrelsome Neighbours","year":1903,"description":"Neighbours fight over painting a fence.","rating":"N/A","poster":"N/A"},{"title":"Railway Ride in the Alps","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Reproduction of the Corbett-McGovern Fight","year":1903,"description":"The last fight between these little giants was fought at San Francisco, March 31, 1903. Interest was centered in this fight because of the reputation of McGovern, who was popularly known as...","rating":"N/A","poster":"N/A"},{"title":"Rock of Ages","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Runaway Match, or Marriage by Motor","year":1903,"description":"Mansion; father's car seen from lover's car; vice versa; church, ring; father arrives too late.","rating":"N/A","poster":"N/A"},{"title":"Saturday Shopping","year":1903,"description":"A henpecked husband gets drunk while his wife shops.","rating":"N/A","poster":"N/A"},{"title":"Scene in Canada -- Logging at Bear Creek","year":1903},{"title":"Scene in Canada -- Spearing Salmon in a Mountain Stream","year":1903},{"title":"A Search for Evidence","year":1903,"description":"A woman and a detective search a hotel for her husband, peering through keyholes. They find him and confront him with his mistress.","rating":"5.4","poster":"N/A"},{"title":"Sensational Hurdle Race","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Shocking Accident","year":1903,"description":"The mistress of a country home is going about inspecting the work done by her servant, when she discovers dust on the railing surrounding the porch, and, calling the servant, she orders the...","rating":"N/A","poster":"N/A"},{"title":"S.S. St. Louis","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Street Car Chivalry","year":1903,"description":"Men on the streetcar offer their seats to pretty women, but not to an ugly woman.","rating":"5.1","poster":"N/A"},{"title":"A Substantial Ghost","year":1903},{"title":"The Tragical Tale of a Belated Letter","year":1903},{"title":"The Tramp's First Bath","year":1903,"description":"A lover and his sweetheart are seated in the park billing and cooing, and, as usual, they are oblivious to everything by which they are surrounded. The lover leaves his girl for a moment ...","rating":"N/A","poster":"N/A"},{"title":"A Trip Through the Gap of Dunloe","year":1903},{"title":"A Trip to the Giant's Causeway","year":1903},{"title":"Trouble in Hogan's Alley","year":1903},{"title":"Trout Fishing, Landing Three Pounder","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"True Love Never Runs Smooth","year":1903,"description":"Johnson's wife finds a letter in his coat from a dame with whom he has been flirting. The letter suggests that he meet her in a nearby café. Mrs. Johnson doesn't do a thing to him. She ...","rating":"N/A","poster":"N/A"},{"title":"Turning the Tables","year":1903,"description":"A policeman confronts a group of boys who have ignored a 'No Bathing Allowed' sign.","rating":"4.7","poster":"N/A"},{"title":"Two Little Vagabonds; or, The Pugilistic Parson","year":1903},{"title":"The Unexpected Bath","year":1903,"description":"A lodger sleeps in the bath and turns the tap on with his foot.","rating":"N/A","poster":"N/A"},{"title":"Wait Till Jack Comes Home","year":1903,"description":"After a builder breaks his leg, he is saved from eviction by the return of his son Jack, a sailor.","rating":"N/A","poster":"N/A"},{"title":"What Happened in the Tunnel","year":1903,"description":"A woman riding a train must contend with the unwelcome advances of a male passenger.","rating":"5.9","poster":"N/A"},{"title":"Wiring Pike in a Mill Stream","year":1903,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Workman's Paradise","year":1903,"description":"A builder looks on as a house builds itself.","rating":"N/A","poster":"N/A"},{"title":"Alligator Farm","year":1904,"description":"During the summer of 1903 at Atlantic City, N. J., the famous summer resort, there was an Alligator Farm, on which thousands of these huge monsters were bred. We succeeded in obtaining the ...","rating":"N/A","poster":"N/A"},{"title":"The Automobile Race","year":1904,"description":"A most novel picture is this. One wonders how it was taken, as the machines are so rapid that before one could take a snapshot they are gone. One after the other they speed past like the ...","rating":"N/A","poster":"N/A"},{"title":"The Chicago Fire","year":1904,"description":"This film created a demand for itself unknown in the moving picture business. We were the only firm who made a reproduction thereof, and the supply was by no means equal to the demand for ...","rating":"N/A","poster":"N/A"},{"title":"The Child Stealers","year":1904},{"title":"Decoyed","year":1904,"description":"A young woman is abducted and forced to beg from passers-by.","rating":"5.3","poster":"N/A"},{"title":"A Ferry in the Far East","year":1904,"description":"Here is an opportunity to witness how the people of the East are ferried across a body of water. Unlike the ferries of our country, where huge boats are in use, the strange people have hung...","rating":"N/A","poster":"N/A"},{"title":"Fording a Stream","year":1904,"description":"A very pretty picture is this. A number of Arabs are seated on their thoroughbred Arabian horses and in single file are fording a stream. This is not alone a pretty picture, as far as ...","rating":"N/A","poster":"N/A"},{"title":"The Great Baltimore Fire","year":1904,"description":"This is an exceedingly lively subject, and one likely to appeal to audiences in all parts of the country. It opens with a spectacular view of the New York city contingent on a dead gallop ...","rating":"N/A","poster":"N/A"},{"title":"High Diving and Reverse","year":1904,"description":"Many pictures of diving from high places have been taken, but this one eclipses all we know of. After many of the boys have performed a number of difficult stunts they begin to come out of ...","rating":"N/A","poster":"N/A"},{"title":"Hurdle Jumping","year":1904,"description":"A popular sport among soldiery is hurdle jumping, and this is one of the prettiest ones we have ever seen. Some of the spirited horses clear the hurdles at one bound, while others miss, and...","rating":"N/A","poster":"N/A"},{"title":"An Intelligent Elephant","year":1904,"description":"Elephants are, as a rule, intelligent animals, but this one is particularly so. He picks up huge logs of wood, many of them weighing several tons each, and carries them to a certain spot, ...","rating":"N/A","poster":"N/A"},{"title":"The Monkey Bicyclist","year":1904,"description":"Here Mr. Monk is seen in an attempt to ride a wheel. His master desires him to ride around the ring and then dive under a rope stretched across the ring, but Monk refuses to do so until ...","rating":"N/A","poster":"N/A"},{"title":"Monkey, Dog and Pony Circus","year":1904,"description":"It amuses one to witness the sagacious animals carrying out the orders of their master.","rating":"N/A","poster":"N/A"},{"title":"Nervy Nat Kisses the Bride","year":1904,"description":"A tramp gets involved in mischief on a train.","rating":"4.6","poster":"N/A"},{"title":"A Nigger in the Woodpile","year":1904,"description":"This is a clever comedy production in several scenes. In the opening scene the hired man is complaining to Farmer Jones that the woodpile is being depleted by thieves. Farmer Jones decides ...","rating":"7.4","poster":"N/A"},{"title":"Parsifal","year":1904,"description":"Klingsor seeks admission to the Holy Grail. Evil summons Kundry. Herzeloid appears with the child Parsifal. Crowning of Amfortas. Wounding of Amfortas. Carrying Amfortas to his bath. Kundry...","rating":"N/A","poster":"N/A"},{"title":"The Lover's Ruse","year":1904,"description":"When the woman he loves turns him away, a man uses a desperate trick to try to gain her affection.","rating":"N/A","poster":"N/A"},{"title":"A Race for a Kiss","year":1904,"description":"Two rivals for a woman's hand agree to participate in an unusual race.","rating":"5.4","poster":"N/A"},{"title":"Raid on a Coiner's Den","year":1904,"description":"Police try to break up a gang that is manufacturing counterfeit coins.","rating":"5.0","poster":"N/A"},{"title":"Revenge!","year":1904,"description":"A mechanic avenges his wronged wife by strangling the guilty officer.","rating":"5.1","poster":"N/A"},{"title":"A Railway Tragedy","year":1904,"description":"A woman arriving at a train station is unaware that a nearby stranger is closely eyeing her and her purse as she leaves her carriage. As she waits for her train, the same stranger lurks ...","rating":"5.4","poster":"N/A"},{"title":"Scarecrow Pump","year":1904,"description":"A boy tries to play a practical joke, but his target has other ideas.","rating":"4.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWJmY2YxYzUtNTYyMy00ZDVkLThjYTMtMDIwNzhkMjQxYmZmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SX300.jpg"},{"title":"The Strenuous Life; or, Anti-Race Suicide","year":1904,"description":"A married couple faces the demands of what Theodore Roosevelt called 'the strenuous life'.","rating":"4.8","poster":"N/A"},{"title":"The Suburbanite","year":1904,"description":"A family moves out to the 'peaceful' suburbs where everything goes wrong, including the mother-in-law moving in.","rating":"5.6","poster":"N/A"},{"title":"Westinghouse Works, 1904","year":1904},{"title":"Adventures of Sherlock Holmes; or, Held for Ransom","year":1905},{"title":"Airy Fairy Lillian Tries on Her New Corsets","year":1905,"description":"A very large woman, wearing a shift, stands beside a bed and tries to put on a corset. After failing to get it around her, she calls her husband in. He stands behind her holding the corset ...","rating":"4.7","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTNmNDZjYjAtMzcxYi00YWIyLWJlZDYtMzU3N2UwYzQ1NzM2XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SX300.jpg"},{"title":"A Ballroom Tragedy","year":1905,"description":"A woman sneaks up behind a seated couple, stabs the woman in the back, and makes an escape.","rating":"4.7","poster":"N/A"},{"title":"Burglar Bill","year":1905,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Coney Island at Night","year":1905,"description":"A panorama of Coney Island, taken at night: the camera sweeps across the scene from a vantage point well above the area. It then moves in for closer views of Dreamland and Luna Park.","rating":"6.2","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmYyMThmNGQtNzUwNC00N2I5LWI3ZjctZDdhZmQ0ZGM3YTBiXkEyXkFqcGdeQXVyMTEzNzczMA@@._V1_SX300.jpg"},{"title":"A Dog Lost, Strayed or Stolen","year":1905,"description":"A woman offers a reward for her missing dog and a huge number of claimants shows up.","rating":"5.2","poster":"N/A"},{"title":"Hippodrome Races, Dreamland, Coney Island","year":1905,"description":"A series of races and exhibitions takes place at the hippodrome track in Coney Island's Dreamland.","rating":"4.7","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWE1MjQzNTYtOTQxMS00MTQzLWExYjUtYTg4NjFhN2RiZjE1XkEyXkFqcGdeQXVyMTEzNzczMA@@._V1_SX300.jpg"},{"title":"Escape from Sing Sing","year":1905,"description":"N/A","rating":"7.6","poster":"N/A"},{"title":"The Green Goods Man; or, Josiah and Samanthy's Experience with the Original 'American Confidence Game'","year":1905,"description":"A country couple comes to the city with their life savings after receiving a letter from a con man. They are relieved of their money, but the police come to the rescue.","rating":"N/A","poster":"N/A"},{"title":"The Great Jewel Mystery","year":1905,"description":"A group of thieves are building a fake coffin as part of a plan to steal a jewel case filled with extravagant and expensive gems. With one of the thieves inside, the fake coffin is loaded ...","rating":"6.1","poster":"N/A"},{"title":"I.B. Dam and the Whole Dam Family","year":1905,"description":"One at a time, we meet eight members of the Dam family. I.B. Dam is a beleaguered patriarch, mopping his brow and sneezing. Mrs. Hellen Dam is loquacious. Jimmy Dam is a dandy, smoking and ...","rating":"5.2","poster":"https://ia.media-imdb.com/images/M/MV5BMmY3NzAxM2MtNDhkMS00ZGZmLWJjMjItYmMwNGZmMGE1YzllXkEyXkFqcGdeQXVyNzUyMjQ3NTQ@._V1_SX300.jpg"},{"title":"The Kleptomaniac","year":1905,"description":"A well-dressed woman leaves her home and takes a carriage to a department store. While she is in the store, she steals several items, and is caught by store employees. Meanwhile, a poor ...","rating":"5.8","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTI3MzI0Nl5BMl5BanBnXkFtZTcwMzQ1MTYzMw@@._V1_SX300.jpg"},{"title":"Impersonation of Britt-Nelson Fight","year":1905,"description":"Reenactment of the 18-round lightweight championship fight between defender Jimmy Britt and challenger Battling Nelson, held on September 9, 1905 in Colma, California. Britt is depicted in the black and white trunks.","rating":"3.8","poster":"N/A"},{"title":"New York Subway","year":1905,"description":"Starting at Union Square, we are taken for an underground excursion, following the path of a subway train as it makes its way through New York City subway tunnels on its journey to the old ...","rating":"5.8","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTRlNmNhMmQtMjc5NS00Yzk5LWI0NjMtNzA0MTM1YmZmY2Q5L2ltYWdlXkEyXkFqcGdeQXVyMDM0MzU2NA@@._V1_SX300.jpg"},{"title":"The Nihilists","year":1905},{"title":"Moving Day; or, No Children Allowed","year":1905,"description":"Parents hide their children in trunks while they move into a new apartment where children are prohibited.","rating":"N/A","poster":"N/A"},{"title":"License No. 13; or, The Hoodoo Automobile","year":1905,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Life of an American Policeman","year":1905,"description":"A policeman has breakfast with his wife and children, and then prepares for the day's work. While on his beat, he finds and helps a lost child. Later, several officers try to save a woman ...","rating":"5.0","poster":"N/A"},{"title":"The Little Train Robbery","year":1905,"description":"In this parody of 1903's _Great Train Robbery, The (1903)_, also made by Edwin S. Porter, young bandits rob the passengers of a kiddie train and are chased by police officers.","rating":"5.7","poster":"N/A"},{"title":"The Night Before Christmas","year":1905,"description":"It's December 24th, and 'Santa Claus' is busy feeding his reindeer and finishing up the toys that he will soon deliver. Meanwhile, the children in a large family hang their stockings over ...","rating":"6.3","poster":"https://m.media-amazon.com/images/M/MV5BMTI0NTQ1ODU5OF5BMl5BanBnXkFtZTcwNjU1ODAwMQ@@._V1_SX300.jpg"},{"title":"A Kentucky Feud","year":1905,"description":"Sally McCoy is in love with Jim Hatfield, but their two families are involved in a bitter feud.","rating":"5.1","poster":"N/A"},{"title":"Peeping Tom in the Dressing Room","year":1905,"description":"A young man leers through a peephole in the wall separating two dressing rooms, but he is caught, and is humiliated by his victim.","rating":"5.6","poster":"N/A"},{"title":"The Newsboy","year":1905,"description":"A poor boy starts out as a newsboy and eventually becomes a Supreme Court Justice.","rating":"N/A","poster":"N/A"},{"title":"A Policeman's Love Affair","year":1905,"description":"A policeman woos a cook for the free meals. When her employer discovers them, the policeman tries to escape, but the employer throws a jug of milk on him.","rating":"N/A","poster":"N/A"},{"title":"The Rat Trap Pickpocket Detector","year":1905,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Reuben in the Opium Joint","year":1905,"description":"A hick tourist visits an opium den and has to be shown the proper way to smoke opium, after initially trying to use the pipe as if it were a flute.","rating":"N/A","poster":"N/A"},{"title":"Raffles the Dog","year":1905,"description":"A couple trains their dog to steal in various ways - picking pockets, snatching purses, and grabbing unattended bags. They prove successful for a while, making off with wallets, delivery ...","rating":"N/A","poster":"N/A"},{"title":"Raffles the Amateur Cracksman","year":1905,"description":"N/A","rating":"5.7","poster":"N/A"},{"title":"The Seven Ages","year":1905,"description":"A couple who have known each other all of their lives are shown together at different stages of life. First, as children, they play together affectionately. Soon afterwards, they are at ...","rating":"5.5","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTI3MzI0Nl5BMl5BanBnXkFtZTcwMzQ1MTYzMw@@._V1_SX300.jpg"},{"title":"The Servant Girl Problem","year":1905,"description":"A couple seeks to replace their incompetent maid, but have very different ideas about the ideal qualities of the new hire. Each gets a chance to make a selection, but things don't go as either of them hoped.","rating":"N/A","poster":"N/A"},{"title":"The Train Wreckers","year":1905},{"title":"Tom, Tom, the Piper's Son","year":1905,"description":"Based loosely on the nursery rhyme: A fair is in progress, with refreshments, entertainment, and other activities. As the rest of the crowd is watching one of the acts, Tom steals a pig and...","rating":"4.6","poster":"N/A"},{"title":"Watermelon Patch","year":1905,"description":"Several men take watermelons from a melon patch, and are pursued.","rating":"4.9","poster":"N/A"},{"title":"The Whole Dam Family and the Dam Dog","year":1905,"description":"The Whole Dam Family and The Dam Dog is a popular fad which has been widely advertised by lithographs and souvenir mailing cards, and has recently been made the subject of a sketch in a New...","rating":"5.4","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGY4NDI0MmQtNjg0Mi00OGE0LWE4MWItYmY3OTk3YjJjY2ZlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SX300.jpg"},{"title":"The Vanderbilt Auto Race","year":1905,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Automobile Thieves","year":1906,"description":"A young couple conducts a series of robberies, followed by a chase, in which they are shot and killed.","rating":"6.3","poster":"N/A"},{"title":"Dream of a Rarebit Fiend","year":1906,"description":"The fiend faces the spectacular mind-bending consequences of his free-wheeling rarebit binge.","rating":"6.8","poster":"https://m.media-amazon.com/images/M/MV5BOWE1YjJkNWMtMmEzZC00NzJhLWEzNWUtNThhOTFlYWY3NmYwXkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_SX300.jpg"},{"title":"From Leadville to Aspen: A Hold-Up in the Rockies","year":1906,"description":"From the point of view of the front end of a train, a group of robbers on a handcar rob the train and murder one of its crew.","rating":"6.2","poster":"N/A"},{"title":"Humorous Phases of Funny Faces","year":1906,"description":"A cartoonist draws faces and figures on a blackboard - and they come to life.","rating":"6.2","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMThhNzVhZGMtNWVjOC00MmQ2LThiNWYtMDljYWU2OTYzOTVhXkEyXkFqcGdeQXVyMzY0NTAwOTk@._V1_SX300.jpg"},{"title":"Kathleen Mavourneen","year":1906,"description":"Captain Clearfield, a wealthy landlord, assaults Kathleen with the help of an accomplice, but Terence O'More arrives in time to break up the attack. Clearfield then tries to get his way by ...","rating":"4.5","poster":"N/A"},{"title":"A Trip Down Market Street","year":1906,"description":"From the front of a cable car, a motion picture camera records a trip down Market Street, San Francisco, California, from a point between 8th & 9th Streets, Eastward to the cable car turnaround at the Ferry Building.","rating":"6.8","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU4MDQ1MDEtODdmNy00ODJlLWEyNTMtNzY3ZDI1NGU2MTFjXkEyXkFqcGdeQXVyNTUyMTMyMDg@._V1_SX300.jpg"},{"title":"Waiting at the Church","year":1906,"description":"N/A","rating":"4.7","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjgwNzU5Ml5BMl5BanBnXkFtZTcwMzExNDA3MQ@@._V1_SX300.jpg"},{"title":"Amateur Night; or, Get the Hook","year":1907,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Ben Hur","year":1907,"description":"The scene opens with an assembly of citizens who are harangued by one of their number, whose words have great weight with the crowd, and their attitude of approval shows that Roman misrule ...","rating":"5.2","poster":"https://m.media-amazon.com/images/M/MV5BMjM3N2QxMzAtNzA0ZS00ZDJmLTk4YjgtZGI0YjNkYjNkOThkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SX300.jpg"},{"title":"Daniel Boone","year":1907,"description":"Daniel Boone is captured by Indians when he tries to rescue his abducted daughter.","rating":"4.6","poster":"N/A"},{"title":"How Brown Saw the Baseball Game","year":1907,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Laughing Gas","year":1907,"description":"A woman goes to the dentist for a toothache and is given gas. On her way home on the subway she can't stop laughing, and every other passenger catches the laughter from her.","rating":"5.9","poster":"N/A"},{"title":"Terrible Ted","year":1907,"description":"A boy reads a western novel and imagines himself as Terrible Ted.","rating":"N/A","poster":"N/A"},{"title":"The Tired Tailor's Dream","year":1907,"description":"A tailor falls asleep and dreams that the suit he needs to make is magically completed.","rating":"7.2","poster":"N/A"},{"title":"The Adventures of Dollie","year":1908,"description":"On a warm and sunny summer's day, a mother and father take their young daughter Dollie on a riverside outing. A gypsy basket peddler happens along, and is angered when the mother refuses to...","rating":"5.7","poster":"https://m.media-amazon.com/images/M/MV5BMDlmYzgwZmItNzdlMS00ZmE5LThkYmUtYmNhNjAyY2FlMmFiXkEyXkFqcGdeQXVyMTYxNjkxOQ@@._V1_SX300.jpg"},{"title":"Antony and Cleopatra","year":1908,"description":"The story of the ill-fated love affair between Marc Antony and Cleopatra.","rating":"3.4","poster":"N/A"},{"title":"Balked at the Altar","year":1908,"description":"Artemisia Sophia Stebbins was a lovelorn maiden who had delved deep into the mysteries of \"Three Weeks,\" as well as being conversant with the teachings of Laura Jean Libby. Her one hobby ...","rating":"5.3","poster":"https://m.media-amazon.com/images/M/MV5BM2RiNjhiN2MtNDY0Ny00OTJhLWI4YTYtYmY5ZTRmNzBhYzllXkEyXkFqcGdeQXVyNzU3NjUzNTc@._V1_SX300.jpg"},{"title":"The Bandit's Waterloo","year":1908,"description":"The Outwitting of an Andalusian Brigand by a Pretty Senora. The hills of Southern Spain were infested by a gang of lawless freebooters who terrorized the country and made travel in the ...","rating":"5.2","poster":"N/A"},{"title":"The Black Viper","year":1908,"description":"A thug accosts a girl as she leaves her workplace but a man rescues her. The thug vows revenge and, with the help of two friends, attacks the girl and her rescuer again as they're going for...","rating":"4.5","poster":"N/A"},{"title":"A Calamitous Elopement","year":1908,"description":"A young couple are enjoying a romantic interlude in the young woman's home, when her father discovers them and angrily chases the young man out of the house. They thus decide to elope, and ...","rating":"4.6","poster":"https://m.media-amazon.com/images/M/MV5BY2Y3YWI2ZTAtNDk1NS00ZjIxLWI2NzAtNzM4ZjgxNTI0MGY1XkEyXkFqcGdeQXVyMzc1NTUwNjM@._V1_SX300.jpg"},{"title":"The Call of the Wild","year":1908,"description":"George Redfeather, the hero of this subject, returns from Carlisle, where he not only graduated with high honors, but was also the star of the college football team. At a reception given in...","rating":"5.5","poster":"N/A"},{"title":"A Christmas Carol","year":1908,"description":"The miser Scrooge passes down a London street the morning before Christmas, on his way to his counting house. So much is he detested that no one speaks to him until a beggar approaches, ...","rating":"5.8","poster":"N/A"},{"title":"Deceived Slumming Party","year":1908,"description":"Several scenes of tours being conducted in New York. At the end of each scene it becomes obvious that the events of the tours have been set up to shock and defraud the tourists.","rating":"5.6","poster":"N/A"},{"title":"Dr. Jekyll and Mr. Hyde","year":1908,"description":"Dr. Henry Jekyll experiments with scientific means of revealing the hidden, dark side of man and releases a murderer from within himself.","rating":"6.1","poster":"N/A"},{"title":"The Fairylogue and Radio-Plays","year":1908,"description":"L. Frank Baum would appear in a white suit and present his live actors, slide shows and films as a live travelogue presentation of his popular fantasies. Highlights include Dorothy being ...","rating":"6.1","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGYxYTQ5ODEtYmU2Yy00MDQ4LWFhMTQtMTc5YTllZjRhY2E4XkEyXkFqcGdeQXVyMDgyNjA5MA@@._V1_SX300.jpg"},{"title":"The Fight for Freedom","year":1908,"description":"In a saloon in a Mexican border town, a group of cowboys, including a Mexican named Pedro, play poker. One man is discovered cheating, and is shot dead by Pedro, who is wounded as he ...","rating":"5.3","poster":"http://ia.media-imdb.com/images/M/MV5BMTI3MDk0MDkwNF5BMl5BanBnXkFtZTcwMjY1NzEyMQ@@._V1_SX300.jpg"},{"title":"Macbeth","year":1908,"description":"Macbeth usurps the Scottish throne by murdering his predecessor.","rating":"6.4","poster":"N/A"},{"title":"Money Mad","year":1908,"description":"The central figure is an old miser, who in parsimonionsness is a Harpahon. And, like Fosene, boarded his money in a secret cellar, where he met his death. We first find him begging on the. ...","rating":"5.8","poster":"N/A"},{"title":"The Red Man and the Child","year":1908,"description":"Alongside of a beautiful mountain stream in the foothills of Colorado there camped a Sioux Indian, who besides being a magnificent type of the aboriginal American, is a most noble creature,...","rating":"5.2","poster":"N/A"},{"title":"Romeo and Juliet","year":1908,"description":"Two feuding houses are united with the marriage and eventual death of their children.","rating":"7.0","poster":"N/A"},{"title":"The Taming of the Shrew","year":1908,"description":"Based on Shakespeare's play: Petruchio courts the bad-tempered Katharina, and tries to change her aggressive behavior.","rating":"5.8","poster":"https://m.media-amazon.com/images/M/MV5BNTkyMzI2MjI4NF5BMl5BanBnXkFtZTYwNjIzOTc4._V1_SX300.jpg"},{"title":"The Tavern Keeper's Daughter","year":1908,"description":"In the lonely wilds of Southern California there stands a rural tavern, kept by an old trapper, who had been widowed years ago; his wife leaving him a most precious legacy in the being of a...","rating":"6.3","poster":"N/A"},{"title":"A B C's of the U.S.A.","year":1909,"description":"N/A","rating":"5.3","poster":"N/A"},{"title":"Adventures of a Drummer Boy","year":1909,"description":"In the home of a Union officer his three children are playing soldier, the oldest, a boy of 12, acting as captain over his two sisters, who are younger. The father is about to leave for the...","rating":"N/A","poster":"N/A"},{"title":"And a Little Child Shall Lead Them","year":1909,"description":"The house divided against itself has been united by the child, as was the case in this story. The dentil of the first horn, at the age of two, left the couple almost inconsolable, and the ...","rating":"5.1","poster":"N/A"},{"title":"At the Altar","year":1909,"description":"At the Italian boarding house the male boarders were all smitten with the charms of Minnie, the landlady's pretty daughter, but she was of a poetic turn of mind and her soul soared above ...","rating":"5.4","poster":"N/A"},{"title":"Boots and Saddles","year":1909,"description":"A story of army life of the '70s on the frontier when the Indians were dissatisfied with the restraint put upon them by the Government...","rating":"N/A","poster":"N/A"},{"title":"The Brahma Diamond","year":1909,"description":"An unscrupulous tourist plots to steal the famous diamond, \"The Light of the World,\" tricking a young woman into helping him. She is caught and imprisoned, while he prepares to sell the diamond and make his getaway.","rating":"5.0","poster":"N/A"},{"title":"A Brave Irish Lass","year":1909,"description":"N/A","rating":"3.8","poster":"N/A"},{"title":"A Burglar's Mistake","year":1909,"description":"Henry is being blackmailed. When the blackmailer breaks into his house, Henry apprehends him at gunpoint and takes the opportunity to rid himself of the blackmailer's threat.","rating":"5.4","poster":"N/A"},{"title":"C.Q.D.; or, Saved by Wireless; a True Story of the Wreck of the Republic","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Castaways","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Cohen at Coney Island","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Cohen's Dream","year":1909,"description":"A companion picture to \"Cohen at Coney Island.\" After the strenuous day at the Island. Cohen and his family return home, retire early, and we find Cohen and his wife almost instantly ...","rating":"N/A","poster":"N/A"},{"title":"A Colonial Romance","year":1909,"description":"A lady and her lover are talking earnestly on the porch as a villainous suitor appears in the rear and watches them. The lover shortly leaves, and after watching him for a few moments the ...","rating":"N/A","poster":"N/A"},{"title":"The Cord of Life[1]","year":1909},{"title":"The Cracker's Bride","year":1909,"description":"Scene 1. The Wedding: Here we have the family and friends assembled on the lawn for a typical Southern wedding...","rating":"N/A","poster":"N/A"},{"title":"The Criminal Hypnotist","year":1909,"description":"To a reception there is invited a celebrated professor of hypnotism, and during the evening he obliges with an exhibition of his wonderful powers. Several of the guests are put under the ...","rating":"5.0","poster":"N/A"},{"title":"Cure for Bashfulness","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Curtain Pole[1]","year":1909},{"title":"A Daughter of the Sun","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Deacon's Love Letters","year":1909,"description":"In the packing room of a fruit store, Sadie and several companions are packing fruit in baskets, laughing and having a jolly good time. The boss enters and things become suddenly quiet. He ...","rating":"N/A","poster":"N/A"},{"title":"The Deception","year":1909,"description":"Of all the agonies of life, that which is most harrowing is the conviction that we have been deceived where we placed all the trust of love, and this is most apparent to Harry Colton, a ...","rating":"4.9","poster":"N/A"},{"title":"A Drunkard's Reformation","year":1909,"description":"A drinking man arrives home, late and sozzled as usual. His wife reminds him that he promised to take their child to a play. The play proves to be a morality tale about the evils of drink; ...","rating":"5.9","poster":"N/A"},{"title":"Edgar Allan Poe","year":1909,"description":"The story, while not biographical, is founded on incidents in his life, showing his devotion for his sick wife, Virginia. Desperate from his utter helplessness to ameliorate his dying ...","rating":"6.1","poster":"N/A"},{"title":"The Energetic Street Cleaner","year":1909,"description":"A story picture of a man compelled by the stress of circumstances to apply for a position as street-cleaner or \"White Wing.'\" To his great delight he is accepted, and he immediately dons ...","rating":"N/A","poster":"N/A"},{"title":"The Fascinating Mrs. Francis","year":1909,"description":"A young man becomes infatuated with Mrs. Francis after she sings at a party. His father convinces her to discourage the young man's attentions. Out of despair, the young man considers suicide, until he meets a woman his own age.","rating":"6.0","poster":"N/A"},{"title":"A Fool's Revenge","year":1909,"description":"A court fool believes the Duke is after his beautiful daughter, and arranges to have the Duke murdered. The daughter overhears the plot and, disguised in the Duke's cloak, sacrifices her life to save him.","rating":"5.3","poster":"N/A"},{"title":"A Friend in the Enemy's Camp","year":1909,"description":"A woodman and his wife are seen working about their hut, their little daughter of about 12 years helping. The mother gives the child a couple of aprons and tells her to wash them in a ...","rating":"N/A","poster":"N/A"},{"title":"The Girls and Daddy[1]","year":1909},{"title":"The Golden Louis","year":1909,"description":"An anonymous donor drops a gold coin in the shoe of a homeless girl as she sleeps. A gambler with a 'sure thing' borrows the coin and wins a fortune, but he can't find her again to repay her.","rating":"5.9","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNTEyOTY4Ml5BMl5BanBnXkFtZTcwMzg1MDA4Mg@@._V1_SX300.jpg"},{"title":"The Haunted Lounge","year":1909,"description":"A tramp being chased by the police hides in a folding lounge that's been left out on the street. The policeman takes the sofa home and is surprised by it.","rating":"N/A","poster":"N/A"},{"title":"The Hindoo Dagger","year":1909,"description":"Jack Windom experiences a sensation of awe at the reception of the Hindoo dagger from his old chum, Tom, who was traveling in India. Hanging the dagger on the wall. Jack goes out. For some ...","rating":"4.0","poster":"N/A"},{"title":"His Ward's Love","year":1909,"description":"Reverend Howson loves his young ward, but urges her to marry someone else. She accepts the proposal, but then sees the Reverend kissing an object she has dropped, and realizes he loves her.","rating":"N/A","poster":"N/A"},{"title":"His Wife's Mother","year":1909,"description":"Jones's mother-in-law prohibits his smoking and drinking, so he takes her out for the evening and gets her drunk.","rating":"5.2","poster":"N/A"},{"title":"The Honor of the Slums","year":1909,"description":"Mary Stokes, whose husband, Bill, is a drunkard, is busily engaged working about the room. Bill enters, goes to the cupboard, finds his whiskey flask empty and starts out to have it filled....","rating":"N/A","poster":"N/A"},{"title":"The Honor of Thieves","year":1909,"description":"Ned Grattan and Mike Murphy are a couple of crooks, who have looked with longing on the extravagant display of valuables in Einstein's loan office. They figure that if one could only gain ...","rating":"N/A","poster":"N/A"},{"title":"I Did It","year":1909,"description":"A mother punishes her son for eating a plate of cream puffs, unaware that the daughter really did it. As the daughter watches the punishment, she feels guilty, and confesses her misdeed.","rating":"5.3","poster":"N/A"},{"title":"Jessie, the Stolen Child","year":1909,"description":"A gypsy caravan passes slowly along the country road. Hugo, on the front seat, drives lazily: Bill, his companion, sits on the back of the wagon smoking, while Liza, another member of the ...","rating":"N/A","poster":"N/A"},{"title":"Jones and His New Neighbors","year":1909,"description":"Jones' new house looks like all the others on the street. One night Jones enters the wrong house and finds himself in a precarious situation.","rating":"5.2","poster":"N/A"},{"title":"The Joneses Have Amateur Theatricals","year":1909,"description":"Well, here we pay another visit to the Jones' domicile, with the same amusing results, for Jones cannot help being funny, and we feel sure that his obituary, not that we are in a hurry to ...","rating":"5.9","poster":"http://ia.media-imdb.com/images/M/MV5BMTUwNTEyOTY4Ml5BMl5BanBnXkFtZTcwMzg1MDA4Mg@@._V1_SX300.jpg"},{"title":"Kenilworth","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"King Lear","year":1909,"description":"N/A","rating":"5.7","poster":"N/A"},{"title":"The Life of Moses","year":1909,"description":"The persecution of the children of Israel by the Egyptians. Now there arose up a new king in Egypt. And he said unto his people...","rating":"5.6","poster":"http://ia.media-imdb.com/images/M/MV5BN2Y0Nzk4MDItOWVkZS00ODg3LTg2ZWYtYjVhYTQ3MjQ3MGI3XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"The Life of Napoleon","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Love Finds a Way","year":1909,"description":"A comedy drama of mediaeval days, when Cupid was obliged to work overtime, and be an inventive genius of subtle powers, resorting to artifice and cunning to work his felicitous plans. In ...","rating":"N/A","poster":"N/A"},{"title":"The Love of the Pasha's Son: A Turkish Romance","year":1909,"description":"Outside the palace, the Pasha and his son, the Prince are see descending the marble steps, several servants preceding them, salaaming as they walk backwards. They proceed to the river bank ...","rating":"N/A","poster":"N/A"},{"title":"The Lure of the Gown","year":1909,"description":"\"Fine feathers make fine birds.'' and handsome gowns make handsome women, and a handsome woman is the most fascinating thing extant. Hence it is when Isabelle appears on the scene clad in a...","rating":"4.7","poster":"N/A"},{"title":"The Mad Miner","year":1909,"description":"The story deals with the adventures of James Hart and his young wife in their search for gold. Sitting out from the trading post one bright morning...","rating":"N/A","poster":"N/A"},{"title":"The Maniac Cook","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Medicine Bottle","year":1909,"description":"While she attends a party, Mrs. Ross leaves her young daughter to care for her bed-ridden mother. At the party, Mrs. Ross realizes she left the wrong medicine, and desperately tries to contact her daughter before it's too late.","rating":"N/A","poster":"N/A"},{"title":"Midnight Disturbance","year":1909,"description":"A burglar has entered the top story of a flat by means of the lire escape, and has the misfortune to arouse the occupants. They give chase, forcing the burglar to return to the fire-escape ...","rating":"N/A","poster":"N/A"},{"title":"Mr. Jones Has a Card Party","year":1909,"description":"Mr. Jones, since his last escapade, had made strenuous efforts to amend the reputation he had gained in the eyes of the ladies of the Temperance League. But Oh! the ordeal, for such it was,...","rating":"5.3","poster":"N/A"},{"title":"Mrs. Jones Entertains","year":1909,"description":"N/A","rating":"5.3","poster":"N/A"},{"title":"Napoleon and the Empress Josephine","year":1909,"description":"Scene 1. The Prophecy: Josephine, while walking in the gardens on the island of Martinique, is told that \"she will be more than Queen and yet outlive her dignity.\" Scene 2. Napoleon Meets ...","rating":"N/A","poster":"N/A"},{"title":"The Old Soldier's Story","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"One Touch of Nature","year":1909,"description":"Policeman John Murray is the proud father of a little girl and the happy husband of a dutiful wife. Both father's and mother's whole life is centered in their little one, and the little ...","rating":"7.6","poster":"N/A"},{"title":"The Politician's Love Story","year":1909,"description":"A corrupt politician, on seeing a satirical cartoon in a newspaper, rushes to the paper's offices to shoot the cartoonist. On discovering the cartoonist is a pretty woman, he falls ...","rating":"5.0","poster":"http://ia.media-imdb.com/images/M/MV5BNjA0MjY4NDk4Nl5BMl5BanBnXkFtZTcwNzg1MDA4Mg@@._V1_SX300.jpg"},{"title":"The Poor Musician","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Prussian Spy","year":1909,"description":"Lady Florence hides her lover, a Prussian spy, from the French troops who are hunting for him. One of her other suitors, a French officer, discovers the hiding place and threatens to kill the spy.","rating":"5.2","poster":"N/A"},{"title":"The Road Agents","year":1909,"description":"This subject is a correct picture story of a once famous California hold-up. Two out-laws, one an Englishman, the other a Mexican (both well known for their daring robberies and their ...","rating":"N/A","poster":"N/A"},{"title":"The Road to the Heart","year":1909,"description":"Miguel casts out his daughter when she marries a poor man, causing his wife to leave him, too. After he is unable to find a reliable cook, he reconciles with his daughter so he can get a good meal.","rating":"N/A","poster":"N/A"},{"title":"A Rural Elopement","year":1909,"description":"\"Be sure you are right, then go ahead,\" is a pretty good rule to follow, and had the heroine of this subject cognized this fact she would have prevented a lot of anxiety, worry and trouble....","rating":"7.8","poster":"N/A"},{"title":"The Sacrifice","year":1909,"description":"Oh, the woe of simultaneous birthdays, as were Mr. and Mrs. Hardlucks', and both being of a generous nature, were seized with an insatiable desire to make on this anniversary of their ...","rating":"5.8","poster":"N/A"},{"title":"The Salvation Army Lass","year":1909,"description":"Mary Wilson, a neglected child of the slums, falls in with Bob Walton, a tough denizen of the lower east side, and loves him with a pure, honest affection that his low nature cannot ...","rating":"4.9","poster":"N/A"},{"title":"A Sister's Love: A Tale of the Franco-Prussian War","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Sister's Love","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Tag Day","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Tale of the West","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Tenderfoot","year":1909,"description":"A comedy depicting cowboy pastimes at Red Dog Gulch. Bill Loomis has charge of a large ranch owned by an English syndicate. The manager, who resides in New York, has a brother, Bertie by ...","rating":"N/A","poster":"N/A"},{"title":"Those Awful Hats","year":1909,"description":"Set in an early cinema house, this comic short illustrates the problems with the gals' hats obscuring the movie patron's line of vision.","rating":"6.3","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDlmYzgwZmItNzdlMS00ZmE5LThkYmUtYmNhNjAyY2FlMmFiXkEyXkFqcGdeQXVyMTYxNjkxOQ@@._V1_SX300.jpg"},{"title":"Those Boys!","year":1909,"description":"Two boys find a pistol their father has hidden. While they're playing with it, they line up a target, not realizing their sisters are on the other side of the door. The parents realize the gun is missing and avert the disaster.","rating":"N/A","poster":"N/A"},{"title":"Tragic Love","year":1909,"description":"Love is not in our choice, but in our fate; and whoever loved that loved not at first sight? Such was the case with Bob Spaulding, a manly fellow, who meets Dr. Rankin and his wife on the ...","rating":"6.5","poster":"N/A"},{"title":"Trying to Get Arrested","year":1909,"description":"A tramp tries to get himself arrested so he can sleep in the nice, warm jail, but the police keep ignoring him or arresting the wrong person.","rating":"5.6","poster":"N/A"},{"title":"The Voice of the Violin","year":1909,"description":"A music teacher is in love with Helen, one of his students, but she rejects him. In his anger he joins a communist group who plan to blow up a rich capitalist's house. When he realizes it's Helen's house, he tries to stop the plan.","rating":"5.1","poster":"N/A"},{"title":"The Welcome Burglar[1]","year":1909},{"title":"Where Is My Wandering Boy Tonight?","year":1909,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Wooden Leg","year":1909,"description":"A father wants to marry his daughter to a rich man, but she's in love with someone else. She borrows a tramp's wooden leg, pretending that it's hers, and the disgusted suitor rejects her.","rating":"7.0","poster":"N/A"},{"title":"A Wreath in Time","year":1909,"description":"A few of us have had the chance to read our own obituary notice, but it fell to the lot of John Goodhusband the rare privilege of viewing his own elegiac cinerary floral offerings, and at ...","rating":"N/A","poster":"N/A"},{"title":"Abraham Lincoln's Clemency","year":1910,"description":"N/A","rating":"3.7","poster":"N/A"},{"title":"An Arcadian Maid","year":1910,"description":"A young girl looking for work, is hired by a farmer's wife to work as a maid. A smooth talking peddler comes by the farm, and flirts with the young maid. He gives the naive girl an ...","rating":"5.5","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjI4NGUwZGQtODUzMi00ZjQzLTg1MjUtZWM2M2U0Y2NjMWZlXkEyXkFqcGdeQXVyNDgyMzQ2NQ@@._V1_SX300.jpg"},{"title":"As It Is In Life","year":1910,"description":"A grief stricken widowed man, devotes his life to caring and providing for his very young daughter. He quickly secures a job at a nearby pigeon farm. One day he runs into an old sweetheart,...","rating":"5.5","poster":"N/A"},{"title":"A Christmas Carol","year":1910,"description":"Based on the story by Charles Dickens: Ebenezer Scrooge is well known for his harsh, miserly ways, until he is visited by the ghost of his former business partner, and then by three other spirits.","rating":"6.1","poster":"https://m.media-amazon.com/images/M/MV5BMTI0NTQ1ODU5OF5BMl5BanBnXkFtZTcwNjU1ODAwMQ@@._V1_SX300.jpg"},{"title":"The Courtship of Miles Standish","year":1910,"description":"Miles Standish, as we all know, was a man among men, a warrior who knew no fear in battle, but who was very timid and abashed when it came to the wooing of the maid Priscilla. Therefore we ...","rating":"N/A","poster":"N/A"},{"title":"The Englishman and the Girl","year":1910,"description":"A small-town drama group's rehearsal is interrupted when one of their members receives a letter telling him his English relative is arriving for a visit. The Englishman turns out to be a ...","rating":"4.8","poster":"N/A"},{"title":"Frankenstein","year":1910,"description":"Frankenstein, a young medical student, trying to create the perfect human being, instead creates a misshapen monster. Made ill by what he has done, Frankenstein is comforted by his fiancée ...","rating":"6.5","poster":"https://m.media-amazon.com/images/M/MV5BMTg2NjMyMjgxOF5BMl5BanBnXkFtZTgwOTMyNzM2MzE@._V1_SX300.jpg"},{"title":"The Fugitive","year":1910,"description":"Two Johns, a Confederate and an Union soldier, leave their family to go to the front. After a skirmish they end up separated from their respective sides, the Union soldier shoots the ...","rating":"5.8","poster":"N/A"},{"title":"Gentleman Joe","year":1910,"description":"N/A","rating":"4.4","poster":"N/A"},{"title":"Hemlock Hoax, the Detective","year":1910,"description":"Hemlock Hoax thinks he can \"put it all over\" Sherlock Holmes, and his sleuthing is somewhat of a joke in the little tropical town where he lives. Two boys plan some fun at his expense and ...","rating":"N/A","poster":"N/A"},{"title":"The House with Closed Shutters","year":1910,"description":"During the Civil War a young soldier loses his nerve in battle and runs away to his home to hide; his sister puts on his uniform, takes her brother's place in the battle, and is killed. ...","rating":"6.0","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Y0ZGUwYTItZGVhMS00ZjRjLWE1NWEtNDZjMTAwMWJiNTc4XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"In Old California","year":1910,"description":"An historical dramatization of a Spanish woman during the reign of Spanish and Mexican owned California in the early 19th century.","rating":"7.2","poster":"N/A"},{"title":"In the Border States","year":1910,"description":"During the Civil War, a father living in a border state leaves to join the Union Army. After he leaves, Confederate troops forage on his property, where a soldier encounters one of his ...","rating":"6.5","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjdkMjYyMjAtNmUyOS00NWUxLWFlZTEtNjcyYTRlZDRlZWE2XkEyXkFqcGdeQXVyMTAwMjAxOTU@._V1_SX300.jpg"},{"title":"A Lad from Old Ireland","year":1910,"description":"A boy from Ireland comes to America and makes good, but he doesn't forget the poverty he left behind. He returns to rescue his sweetheart just as her family is about to be evicted from their land.","rating":"4.8","poster":"N/A"},{"title":"Pocahontas","year":1910,"description":"N/A","rating":"5.8","poster":"N/A"},{"title":"Pride of the Range","year":1910,"description":"This is a completely bogus entry; no film bearing this title was either produced or distributed by Selig or any other company during this time period; Tom Mix, as well as the other players ...","rating":"N/A","poster":"N/A"},{"title":"Ramona","year":1910,"description":"Ramona is a little orphan of the great Spanish household of Moreno. Alessandro, the Indian, arrives at the Camulos ranch with his sheep-shearers, showing his first meeting with Ramona. ...","rating":"5.9","poster":"N/A"},{"title":"The Rocky Road","year":1910,"description":"The evils of drink cause a man to separate from his family. In time he becomes sober and prosperous. Then he meets and falls in love with a young woman, and they become engaged. Unbeknownst to him this young woman is his own daughter.","rating":"5.6","poster":"http://ia.media-imdb.com/images/M/MV5BMTUwNTEyOTY4Ml5BMl5BanBnXkFtZTcwMzg1MDA4Mg@@._V1_SX300.jpg"},{"title":"Roosevelt in Africa","year":1910,"description":"N/A","rating":"5.9","poster":"N/A"},{"title":"Rose O'Salem-Town","year":1910},{"title":"The Sanitarium","year":1910,"description":"Charley Wise with a Waldorf appetite on a beany salary finds himself growing unpopular with his landlord as well as other creditors. In fact the sighing breezes seem to whisper \"Charley ...","rating":"6.4","poster":"N/A"},{"title":"The Two Brothers","year":1910,"description":"In Camarillo, principality of the Spanish dominion, there lived two brothers, Jose and Manuel. Born in a noble Spanish family and reared by a mother noble in both station and character, ...","rating":"5.1","poster":"N/A"},{"title":"The Unchanging Sea","year":1910,"description":"In this story set at a seaside fishing village and inspired by a Charles Kingsley poem, a young couple's happy life is turned about by an accident. The husband, although saved from drowning...","rating":"6.6","poster":"http://ia.media-imdb.com/images/M/MV5BMDlmYzgwZmItNzdlMS00ZmE5LThkYmUtYmNhNjAyY2FlMmFiXkEyXkFqcGdeQXVyMTYxNjkxOQ@@._V1_SX300.jpg"},{"title":"What the Daisy Said","year":1910,"description":"Two sisters want to know whether there is romance in their future. One sister pulls the petals off of a flower, while the other has her fortune told by a gypsy. When the gypsy tells the ...","rating":"5.5","poster":"https://m.media-amazon.com/images/M/MV5BMjE5MjAxNjg1NV5BMl5BanBnXkFtZTYwMjU5NDM5._V1_SX300.jpg"},{"title":"The Woman from Mellon's","year":1910,"description":"Harry Townsend, a young stock broker, is in love with the pretty daughter of James Petersby, a Wall Street magnate, and as Harry is a very promising young fellow, he gives his consent to ...","rating":"3.2","poster":"N/A"},{"title":"The Wonderful Wizard of Oz","year":1910,"description":"An early version of the classic, based more on the 1902 stage musical than on the original novel.","rating":"5.7","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGU4NjRlOTgtMDU1YS00OTNiLWI0YmQtNmUzNzI2NjdiZjVmXkEyXkFqcGdeQXVyNDk0MDg4NDk@._V1_SX300.jpg"},{"title":"Baseball and Bloomers","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Black Arrow: A Tale of the Two Roses","year":1911},{"title":"Brown of Harvard","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Cally's Comet","year":1911,"description":"May Deering is the daughter of a celebrated astronomer who is more interested in the heavens than he is in his daughter's sweetheart, Jack Webster. In fact, he holds not a tiny jot of ...","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWUzY2M4ODUtYTgyMi00YWU1LTk4ZjAtN2NkYzdjYzRmNDYwXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"The Coffin Ship","year":1911,"description":"A wealthy ship owner cared for but two things in life, his gold and his daughter. But his selfish love of the girl led him to frown upon her suitors, while his greed for gold induced him to...","rating":"5.5","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDdmNTgwODgtMDNkZi00NDM2LTljMmEtYjMxNjIwMWIwOTYwXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"The Colonel and the King","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Courting Across the Court","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Cowboy and the Lady","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Flames and Fortune","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"For Her Sake","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Her Awakening","year":1911,"description":"An attractive young woman is ashamed of her shabbily-dressed mother, and won't introduce her to her suitor. Distraught, the mother wanders into the street and is killed. Too late, the ...","rating":"7.2","poster":"N/A"},{"title":"The Higher Law","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"David Copperfield","year":1911,"description":"N/A","rating":"7.1","poster":"N/A"},{"title":"His Trust Fulfilled","year":1911,"description":"Continuing where His Trust (1911) leaves off, George, a slave, takes care of his deceased master's daughter after her mother's death. He sacrifices his own meager savings to give the girl a...","rating":"5.0","poster":"https://m.media-amazon.com/images/M/MV5BMDlmYzgwZmItNzdlMS00ZmE5LThkYmUtYmNhNjAyY2FlMmFiXkEyXkFqcGdeQXVyMTYxNjkxOQ@@._V1_SX300.jpg"},{"title":"The Italian Barber","year":1911,"description":"Tony, the barber, on his way to the shop meets little Alice, the newsgirl, who runs a stand on a neighboring corner. He at once becomes smitten and can think of nothing else. Later they are...","rating":"5.9","poster":"N/A"},{"title":"The Last of the Mohicans","year":1911,"description":"Magua, a worthless, treacherous chief, is expelled from his tribe and becomes a guide in the army. His drunkenness causes him to be lashed and drummed from the fort. He endures the ...","rating":"7.6","poster":"N/A"},{"title":"The New Superintendent","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Pasha's Daughter","year":1911,"description":"An American in Turkey is mistakenly arrested and thrown in jail. He escapes and is helped by the daughter of the local ruler, called the Pasha.","rating":"4.5","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWY0MTYxNTctMmE1NC00YzkxLTk5ZWQtMzQ3MjQ0YTdlMjgyXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"Princess Clementina","year":1911,"description":"King James' agent saves a Dutch princess and marries her as the King's proxy.","rating":"N/A","poster":"N/A"},{"title":"The Railroad Builder","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Scarlet Letter","year":1911,"description":"N/A","rating":"7.5","poster":"N/A"},{"title":"The Smuggler","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Sweet Memories","year":1911,"description":"An elderly woman looks back on the special times in her life, thinking especially about her now-departed husband and the things they did together. Though it is sad that these times are now ...","rating":"5.1","poster":"N/A"},{"title":"A Tale of Two Cities","year":1911,"description":"A condensed silent film version of the Charles Dickens classic about the French Revolution and its subsequent Reign of Terror.","rating":"6.5","poster":"http://ia.media-imdb.com/images/M/MV5BMTMwMzcwNDQ5OF5BMl5BanBnXkFtZTcwMzU1NDE2Mw@@._V1_SX300.jpg"},{"title":"That's Happiness","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Two Paths","year":1911,"description":"Florence and Nellie are dressmakers, sewing to eke an existence. A wealthy woman calls for a gown they have just finished. She is accompanied by an unconscionable profligate, who, tempting ...","rating":"6.3","poster":"N/A"},{"title":"The Voice of the Child","year":1911,"description":"A businessman neglects his wife, who is tricked into believing he is having an affair. She packs to leave him, but is distracted by their little girl, and can't bear to go.","rating":"N/A","poster":"N/A"},{"title":"Won by Wireless","year":1911,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"All for a Girl","year":1912,"description":"Billy Joy, a young reporter, is told by his chief, if he will secure certain letters connected with a prominent divorce scandal, he will raise his wages $10 a week. This increase will make ...","rating":"N/A","poster":"N/A"},{"title":"At the Foot of the Ladder","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Aurora Floyd","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Baby Hands","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Bandit of Tropico","year":1912,"description":"William Blake is a respected citizen of Tropico, Cal., a man looked up to by his neighbors and worshiped by a devoted daughter, whose love he fully reciprocates. The inhabitants of Tropico ...","rating":"N/A","poster":"N/A"},{"title":"A Battle of Wits","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Belle of Bar-Z Ranch","year":1912,"description":"Jessie, the Belle of the Bar Z Ranch, and Jack Howard are lovers. On the day of the cowboys' \"hoedown,\" Jack presents Jess with a beautiful engagement ring and Jessie promises to marry him ...","rating":"N/A","poster":"N/A"},{"title":"A Business Buccaneer","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Charge of the Light Brigade","year":1912,"description":"Retelling of the famous incident in the 1854 Crimean War when a British cavalry unit, because of a mix-up in orders, charged an almost impregnable Russian artillery position and was decimated.","rating":"7.0","poster":"http://ia.media-imdb.com/images/M/MV5BMTc0MTM2ODU5Ml5BMl5BanBnXkFtZTcwOTk3MDUzMQ@@._V1_SX300.jpg"},{"title":"Conductor 786","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The County Fair","year":1912,"description":"N/A","rating":"5.8","poster":"N/A"},{"title":"The Cry of the Children","year":1912,"description":"An indicment of the evils of child labor, the film was controversial in its time for its use of actual footage of children employed in a working mill.","rating":"6.1","poster":"N/A"},{"title":"The Deserter","year":1912,"description":"A deserting soldier encounters a wagon train of settlers. When they are faced with an Indian attack, he risks court martial to return to the Army post for help.","rating":"N/A","poster":"N/A"},{"title":"The Eternal Mother","year":1912,"description":"John and Mary divorce their spouses to marry each other. Mary dies after giving birth and the baby is taken in by John's first wife, Martha. She refuses all contact with John until many ...","rating":"4.5","poster":"https://m.media-amazon.com/images/M/MV5BNWQ1ODJlMjMtOTdmMS00ZWZiLTkwOTctNDAwN2E5MmE0ODE4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjkyMjkxOTE@._V1_SX300.jpg"},{"title":"Dr. Jekyll and Mr. Hyde","year":1912,"description":"Dr. Henry Jekyll experiments with scientific means of revealing the hidden, dark side of man and releases a murderer from within himself.","rating":"6.0","poster":"https://m.media-amazon.com/images/M/MV5BZGRkZGQyOTctZDdiYi00NjM5LWEzZTYtYzE4MjBlYjVlMDc5XkEyXkFqcGdeQXVyMTYxNjkxOQ@@._V1_SX300.jpg"},{"title":"For His Son","year":1912,"description":"A father, anxious for his son's financial well being, develops a special soda pop called Dopokoke which is laced with cocaine. Dopokoke is advertised as relief \"for that tired feeling.\" The...","rating":"6.5","poster":"N/A"},{"title":"Frankfurters and Quail","year":1912,"description":"The young couple were happy, and the fact that they had very little money was absolutely no difference to them. Wealth, however, came to the man and wife through the unexpected death of a ...","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWE3MjRkYTgtOTE5ZS00M2Y5LTllYmQtNWQzMWMwODYxOTYzXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"From the Manger to the Cross","year":1912,"description":"An account of the life of Jesus Christ, based on the books of the New Testament: After Jesus' birth is foretold to his parents, he is born in Bethlehem, and is visited by shepherds and wise...","rating":"5.8","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNzgzMTYyMl5BMl5BanBnXkFtZTgwMzMwNTk5MTE@._V1_SX300.jpg"},{"title":"The Half-Breed's Way","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"His Only Son","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"It Happened Thus","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Land Beyond the Sunset","year":1912,"description":"A young boy, opressed by his mother, goes on an outing in the country with a social welfare group where he dares to dream of a land where the cares of his ordinary life fade.","rating":"7.1","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMDcxMjgyNl5BMl5BanBnXkFtZTcwOTgxNjg4Mg@@._V1_SX300.jpg"},{"title":"A Leap for Love","year":1912,"description":"Arthur Law and Samuel Kingston are both aspirants for the hand of Marguerite Leonard. Kingston, however. is the favored one until he seems to be a coward in the eyes of his sweetheart. He ...","rating":"N/A","poster":"N/A"},{"title":"The Little Girl Next Door","year":1912,"description":"Randall and Ruth Foster were little tots. The two children lived side by side on one of the fashionable streets in New York City. One day Helen and her parents were starting for the park ...","rating":"5.2","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmUxNjQ0M2MtMzg4My00ZmM0LWE5MjctMjliMzljNWU0MDE1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_SX300.jpg"},{"title":"The Musketeers of Pig Alley","year":1912,"description":"A young wife and her musician husband live in poverty in a New York City tenement. The husband's job requires him to go away for for a number of days. On his return, he is robbed by the ...","rating":"6.7","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNzk5MDYzOV5BMl5BanBnXkFtZTgwNzQ3Njk5MTE@._V1_SX300.jpg"},{"title":"A New Cure for Divorce","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The New York Hat","year":1912,"description":"When Mrs. Harding dies, she leaves a mysterious letter to her pastor. The note tells how her cold, miserly husband worked her to death. She asks the pastor to administer a small trust which...","rating":"6.5","poster":"http://ia.media-imdb.com/images/M/MV5BMTgzNDIwMzM3MV5BMl5BanBnXkFtZTcwOTAxOTAyMQ@@._V1_SX300.jpg"},{"title":"The Old Bookkeeper","year":1912,"description":"A beloved old man is fired by a new manager who wants to give the bookkeeping job to his friend. Trying to contact his employer, who doesn't know about the firing, the old man foils a ...","rating":"N/A","poster":"N/A"},{"title":"Petticoat Camp","year":1912,"description":"Several married couples go on a camp-out together, but the women soon realize that the men expect them to do all the dirty work.","rating":"6.4","poster":"N/A"},{"title":"Please Help the Pore","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Power of Melody","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Put Yourself in His Place","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Saved from the Titanic","year":1912,"description":"A young woman tells her parents and fiance (in flashback) about the recent sinking of the Titanic and her experiences as a passenger during the disaster. Her intended marriage now faces a ...","rating":"7.4","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjkwNmYyYjQtMGJmNi00YWFiLWEyYzYtYjMzZjIwYTk2ODI2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_SX300.jpg"},{"title":"A Six Cylinder Elopement","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Standing Room Only","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Street Singer","year":1912,"description":"Our story opens with a scene on Fifth Avenue, New York, in the neighborhood of 34th Street, where a small crowd is gathered about Papita, a little street singer, who stands holding her ...","rating":"N/A","poster":"N/A"},{"title":"The Tell-Tale Message","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Thunderbolt","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"An Unseen Enemy","year":1912,"description":"The physician's death orphans his two adolescent daughters. Their older brother is able to convert some of the doctor's small estate to cash. But it is late in the day, and with the banks ...","rating":"6.7","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDlmYzgwZmItNzdlMS00ZmE5LThkYmUtYmNhNjAyY2FlMmFiXkEyXkFqcGdeQXVyMTYxNjkxOQ@@._V1_SX300.jpg"},{"title":"The Voice of Conscience","year":1912,"description":"An orphan girl was given a home by one of her father's friends, who, with his mother, carefully looked after her. The girl's benefactor was much her senior, but soon fell desperately in ...","rating":"6.0","poster":"https://ia.media-imdb.com/images/M/MV5BODlhZTgwMmUtNTk5OC00OWQ1LWFlNmMtYTBhMDJhZTBiMzdmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SX300.jpg"},{"title":"What Happened to Mary","year":1912,"description":"The forerunner of all serials, What Happened to Mary was a series of twelve monthly one reel episodes, each a complete entity in itself, revolving its immediate dramatic and melodramatic ...","rating":"6.9","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWEzMDBmN2YtMjAwMy00ZTJjLTk4ZTgtMzU0OGRhM2U0N2QxXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_SX300.jpg"},{"title":"When the Heart Calls","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"With the Mounted Police","year":1912,"description":"The aqueduct police had many duties to perform, and continual vigil was the price of order, owing to the fact that many dangerous aliens were in the territory they guarded. On one occasion ...","rating":"N/A","poster":"N/A"},{"title":"The Young Millionaire","year":1912,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Adventures of Kathlyn","year":1913,"description":"The daughter of an adventurer in India is kidnapped by a native king, whom she is forced to marry. She has several adventures battling natives and wild animals.","rating":"5.9","poster":"https://m.media-amazon.com/images/M/MV5BZWRiOTg2ZDUtOTU4YS00NTE2LWI5ZDAtZTUzMzk2MDA0NjdlXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"American Born","year":1913,"description":"The dying mother, tells her only child, an orphan, of the wealth and power of her family and of her royal blood. Guided by the honesty of an old Indian servant, Dorothy, known in America as...","rating":"N/A","poster":"N/A"},{"title":"Article 47, L'","year":1913},{"title":"Back to Life","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Barney Oldfield's Race for a Life","year":1913,"description":"Virtuous Mabel rejects the improper advances of a villainous cad. The furious villain and his henchmen then seize Mabel and chain her to a railroad track. Mabel's anxious boyfriend turns ...","rating":"6.2","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMTQ4NTA5N15BMl5BanBnXkFtZTcwMDI5NjkxMQ@@._V1_SX300.jpg"},{"title":"Beau Brummel","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Beautiful Bismark","year":1913,"description":"The business man was thoroughly disgusted with his son, for the boy was a failure at college and did not show any signs of ever amounting to anything. The last straw was when he announced ...","rating":"N/A","poster":"N/A"},{"title":"Bianca","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Bloodhounds of the North","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Bob's Baby","year":1913,"description":"Bob, a typically devoted husband, is told by his wife that the stork has paid a visit to their household; the first time...","rating":"N/A","poster":"N/A"},{"title":"The Caged Bird","year":1913,"description":"The beautiful young princess was weary of the formality and ceremony that encompassed her. She had read many books and from them had gained the idea that she would be far happier as a ...","rating":"7.4","poster":"N/A"},{"title":"Calamity Anne's Beauty","year":1913,"description":"When Dr. Stickum, with a professional beauty, came to town, he stopped his traveling wagon in the main street, lit his torch and proceeded to expound the merits of his beautifier. Calamity ...","rating":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BNTc4ZTI3MGUtNWEyMS00ZDY2LThkZjQtMjc5YmMwZTUwYWIzXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"Calamity Anne's Dream","year":1913,"description":"When at last her eyes grew dim from the long strain of reading the pictures in an illustrated treatise on the Cannibal Islands, Calamity cast aside the book and settled down for the night ...","rating":"N/A","poster":"N/A"},{"title":"Calamity Anne's Inheritance","year":1913,"description":"Calamity Anne, forty-five years of age, attired in wide slouch hat, short riding skirt, and smoking her everlasting pipe, leaned against a shanty and talked with the Misses Baxter and ...","rating":"N/A","poster":"N/A"},{"title":"Calamity Anne's Vanity","year":1913,"description":"Poor Calamity Anne, with her everlasting mule, strolled through the camp, very forlorn at the spectacle of every fellow with his girl and every girl with her fellow. Hence Calamity brooded ...","rating":"N/A","poster":"N/A"},{"title":"Calamity Anne, Heroine","year":1913,"description":"Calamity Anne is trudging along the country road with her burro in tow. Tommy gets stubborn and refuses to travel further until he gets something to eat. The tactics amuse an auto party ...","rating":"N/A","poster":"N/A"},{"title":"Cohen Saves the Flag","year":1913,"description":"Cohen is a sergeant in the Union Army and the bitter rival of another officer for the attentions of Rebecca. Like most burlesque Jewish characters of this period, this caricature borders on...","rating":"4.6","poster":"N/A"},{"title":"The Cub Reporter's Temptation","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Cupid in a Dental Parlor","year":1913,"description":"Harold is in love with Ethel Parks, but finds scant favor with her father, Parks always manages to get his daughter away from her admirer...","rating":"N/A","poster":"N/A"},{"title":"A Desperate Chance","year":1913,"description":"Tom and Joe, brakemen on the N. and O. Railroad, are the best of friends until Ruth, the new operator, arrives at Crawley. The rivalry to gain her favor, friendly at first, soon causes the ...","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGYzZGM2NWYtYzU0OC00ZTM1LWFjMWItMjY5NmMwNzQwM2ZiXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"Dr. Jekyll and Mr. Hyde","year":1913,"description":"Dr. Henry Jekyll experiments with scientific means of revealing the hidden, dark side of man and releases a murderer from within himself.","rating":"5.4","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmU0OGQ3ZTMtMDAyOS00MjQ5LThjMzAtYmMyOGEwYzA0MjBlXkEyXkFqcGdeQXVyNDY2NDMxNDY@._V1_SX300.jpg"},{"title":"The Evidence of the Film","year":1913,"description":"A messenger boy is wrongfully accused of stealing bonds worth $20,000.","rating":"6.3","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWI4MjcyMmUtOTlkZC00MTlmLWEzNDktZjU3NmI0ZTg5MzZhXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SX300.jpg"},{"title":"The Face at the Window","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Fire Coward","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Flirt and the Bandit","year":1913,"description":"Ione, a Spanish girl, is deemed and recognized among her circle of friends as a heartless flirt. One afternoon, while seated at the edge of a pond in her father's garden, she is startled by...","rating":"N/A","poster":"N/A"},{"title":"For the Crown","year":1913,"description":"Following the first adventures of Jacques, the king, repentant of his insult to the church, again embraces the faith and shortly after, falling ill, he dies. The second adventure opens with...","rating":"N/A","poster":"https://ia.media-imdb.com/images/M/MV5BNTBmMmNhNzYtZmI3MS00OWRkLThjYzUtMWY4ODhjODgxOTk0XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"For the Flag","year":1913,"description":"Lieutenant Jack Bronson is partaking of a private dinner he is giving to his classmates when Captain Williams enters and addresses himself to the young lieutenant. It is quite evident from ...","rating":"N/A","poster":"N/A"},{"title":"A Forest Romance","year":1913,"description":"N/A","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWJiZWFhZTAtY2JhYy00OTkxLWE1Y2UtYTNmY2E3OGZkZDNlXkEyXkFqcGdeQXVyMTcyODY2NDQ@._V1_SX300.jpg"},{"title":"The Game Warden","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Girl and the Greaser","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Greater Love","year":1913,"description":"A band of outlaws arc worrying the ranchmen and farmers. The sheriff and a posse are sent out to round them up. One of the band secures a position with Ranchman Worth in order to watch the ...","rating":"N/A","poster":"N/A"},{"title":"His Chum the Baron","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Hulda of the Netherlands","year":1913},{"title":"Hurricane in Galveston","year":1913,"description":"N/A","rating":"7.0","poster":"N/A"},{"title":"In the Secret Service","year":1913,"description":"General Gordon, of the Federal army, receives a message from General Grant, telling him to intercept important dispatches \"from Lee to Webber, carried over wires\" in Gordon's vicinity. ...","rating":"N/A","poster":"N/A"},{"title":"Justice of the Wild","year":1913,"description":"An Indian woman, taking justice into her own hands, kills her lawless husband for the murder of her father.","rating":"N/A","poster":"N/A"},{"title":"A Little Hero","year":1913,"description":"Mabel has a canary bird, a tiny pet dog and a cat. She goes out, and the cat goes after the canary. Doggie hears the racket and takes in the situation. Knowing he is no match for Tabbie he ...","rating":"4.7","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDM4MWJhMDctMDJhNy00M2ExLThkMTgtNWM3MjA4MjRjMGZmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjkyMjkxOTE@._V1_SX300.jpg"},{"title":"The Mirror","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Oil and Water","year":1913,"description":"N/A","rating":"5.0","poster":"N/A"},{"title":"The Old Monk's Tale","year":1913,"description":"A monk tells a tale about a woman who can only surrender her heart to a man who can offer her jewels. A poor man falls in love with her and steals jewels off a statue of the Madonna to give to her.","rating":"6.1","poster":"N/A"},{"title":"The Proof of the Man","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Quakeress","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Restless Spirit","year":1913,"description":"The Dreamer is unhappy with his marriage and runs away. He collapses and is found by The Desert Flower, who convince him to return to his family. In various illusions he sees himself in ...","rating":"N/A","poster":"https://ia.media-imdb.com/images/M/MV5BODY2OTVjYjItMTI0ZC00MzFiLWFkNjgtN2VlYTAzZGJlYzFlXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"The Rose of San Juan","year":1913,"description":"Ben Cameron, a young Southerner from Virginia, goes to California in the early fifties to take up government land. As he enters the little city of San Juan he finds upon the road a starving...","rating":"N/A","poster":"N/A"},{"title":"Rory o' the Bogs","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Sally Scraggs, Housemaid","year":1913,"description":"Doris Lowrey, a famous novelist, in order to get material for her new novel - \"Sally Scraggs, Housemaid,\" leaves her home of luxury and...","rating":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTk0MDM5MzgxMF5BMl5BanBnXkFtZTgwNDYwMTk3MjE@._V1_SX300.jpg"},{"title":"Shadows of the Moulin Rouge","year":1913,"description":"A Parisian doctor, infatuated with the wife of his benefactor, drugs and kidnaps her, and tries to convince the husband that she is dead.","rating":"6.2","poster":"N/A"},{"title":"The Shoemaker and the Doll","year":1913,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Telephone Girl and the Lady","year":1913,"description":"A telephone operator hears a robbery in progress over the Phone and goes in search for help.","rating":"5.5","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNThmNTQwZTMtYzc0ZS00MWM2LWI3YjYtNDA5ZGY1OTU2MTFhXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"Three Friends","year":1913,"description":"Each night, after the day's work at the factory, the three bachelor friends met and declared anew their attachment over a social glass. They bound themselves to remain thus as long as life ...","rating":"N/A","poster":"N/A"},{"title":"The Twelfth Juror","year":1913,"description":"A play based on a famous English case of a man being executed wrongfully on circumstantial evidence. Harry Baker and Alice Charlton meet at the preparations for a barn dance. He takes her ...","rating":"N/A","poster":"N/A"},{"title":"Unto the Third Generation","year":1913,"description":"A young Jewish woman wrestles with the dilemma of an interfaith marriage.","rating":"N/A","poster":"N/A"},{"title":"While There's Life","year":1913,"description":"Rose had hoped to marry Brill and hers was true love, but the sister became Mrs. J. Brill and Rose made the entry in her diary, then fell into a restless sleep. Six months of marriage found...","rating":"N/A","poster":"N/A"},{"title":"Woman's Honor","year":1913,"description":"Madge Williams, a shawl about her figure, crept into the little town, a cast off woman. Billy Wayne made love to Jessalyn on the front porch of the rector's house and Father Bob, the ...","rating":"N/A","poster":"N/A"},{"title":"Across the Pacific","year":1914,"description":"The Escott family, on their way to Montana, is attacked by Indians. Army Lt. Joe Lanier afterwards finds little Elsie Escott, the only survivor, and brings her to his mother, who takes in ...","rating":"N/A","poster":"N/A"},{"title":"The Amateur Detective","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"An American Citizen","year":1914,"description":"N/A","rating":"3.2","poster":"N/A"},{"title":"The Archeologist","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Aristocracy","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"At the Potter's Wheel","year":1914,"description":"The picture opens with scenes at a pottery located at Suresne, a small town near Paris, France. The potters and decorators are seen at work and a vase is made on the potter's wheel. Among ...","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjYwOWM2ZGQtZDk0Ni00NWFhLWFhYzktNDdiYWRkODYwNDY3XkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"The Avenging Conscience","year":1914,"description":"Objected to date his sweetheart by his uncle, a young man turns his thoughts to murder.","rating":"6.9","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQwOTk3MDExOV5BMl5BanBnXkFtZTgwNDY1MTEwMjE@._V1_SX300.jpg"},{"title":"Back to the Farm","year":1914,"description":"Tom and Bob go to visit their aunt, who's left a key under the mat for them. They enter the wrong apartment and help themselves to dinner and a bed.","rating":"6.4","poster":"N/A"},{"title":"The Baggage Smasher","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Bargain","year":1914,"description":"After the bandit Jim Stokes robs the stage he is wounded fleeing. Recuperating at a ranch, he falls in love with and marries the daughter. Now wishing to go straight he tries to return the ...","rating":"6.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWM4ODFiYjAtZDQ4MC00YjFmLTlmYTAtMDE1ZDM0NTExNmZiXkEyXkFqcGdeQXVyNDk0MDM0Mzg@._V1_SX300.jpg"},{"title":"Barnyard Flirtations","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Bath House Beauty","year":1914},{"title":"The Battle of the Sexes","year":1914,"description":"N/A","rating":"6.1","poster":"N/A"},{"title":"The Beggar Child","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Between Showers","year":1914,"description":"Charlie and another man compete in trying to help a young lady cross a muddy street. The rival finds a wooden plank which Charlie takes from him. They fight over an umbrella belonging to ...","rating":"5.6","poster":"https://m.media-amazon.com/images/M/MV5BYzQ3YzBkZGYtZTYxMi00YTNhLTg2YzctNzExYTkzZDU0NzM1XkEyXkFqcGdeQXVyNDUzNzExOTE@._V1_SX300.jpg"},{"title":"Billy's Rival","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Blowout at Santa Banana","year":1914,"description":"Wall-Eyed Pete, Curly Whiskerlegs and Rattlesnake Pete, known as the three guardsmen, get in bad with three pretty waitresses by misinterpreting the girls' request of the amorous trio that ...","rating":"N/A","poster":"N/A"},{"title":"The Body in the Trunk","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Boer War","year":1914,"description":"N/A","rating":"5.4","poster":"N/A"},{"title":"Break, Break, Break","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Brewster's Millions","year":1914,"description":"Robert Brewster, a scion of a well-to-do family, elopes with Louise Sedgewick. Peter Brewster disinherits Robert and refuses to be reconciled to the marriage, and later drives the young ...","rating":"7.3","poster":"https://m.media-amazon.com/images/M/MV5BMzBmOWUyZjAtYTllNy00OWIxLThkOWMtNDg4ZmViY2E3OTU3XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"Brute Force","year":1914},{"title":"Business Versus Love","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Busy Day","year":1914,"description":"A jealous wife is chasing her unfaithful husband during a parade, after he starts to flirt with a pretty woman.","rating":"4.9","poster":"https://m.media-amazon.com/images/M/MV5BZDQ0YjJjMmEtZGUzMC00MWYyLWI2YjEtYjA4ZTMyMDE0OTRlXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"The Butterfly","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Calamity Anne's Love Affair","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Call of the North","year":1914,"description":"Trader Ned Stewart's father Graehme was unjustly accused of adultery and killed. Ned sets out to avenge his father but is captured and send on \"la longue traverse,\" the long journey to ...","rating":"5.7","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWMwODlmOGEtM2MxYS00YzBlLWI1MmItNjJhOTk3MDUzYzQ2L2ltYWdlXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"The Call of the Traumerei","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Called Back","year":1914,"description":"The blind husband of an Italian doctor's mad ward 'sees' her brother murdered during a trance.","rating":"N/A","poster":"N/A"},{"title":"The Cameo of the Yellowstone","year":1914},{"title":"Captain Alvarez","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Caught in a Cabaret","year":1914,"description":"Charlie is a clumsy waiter in a cheap cabaret and must endure the strict orders from his boss. He meets a pretty girl in the park and pretends to be a fancy ambassador but must contend with the jealousy of her fiancé.","rating":"5.9","poster":"https://m.media-amazon.com/images/M/MV5BMTUyNDQzNTk5N15BMl5BanBnXkFtZTgwMTE5MDgwMjE@._V1_SX300.jpg"},{"title":"Caught in the Rain","year":1914,"description":"When a married couple become separated in the park, Charlie takes up with the lady and is beat up when her husband rejoins her. He takes a room in their hotel, and she sleepwalks into his ...","rating":"5.8","poster":"https://m.media-amazon.com/images/M/MV5BN2NmMWYyNmQtNGExMy00NmEwLTk3NDMtYjdlMGE5YmNjYmI3XkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"The Certainty of Man","year":1914,"description":"The cock-sure deputy sheriff, through circumstantial evidence, places the positive guilt of a certain crime on a man he had previously esteemed a friend. His sworn testimony on the witness ...","rating":"N/A","poster":"N/A"},{"title":"Chicken Chaser","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Cinderella","year":1914,"description":"Based on the fairy tale: Cinderella is mistreated by her stepmother and stepsisters, but is able to go to the royal ball through the help of the Fairy Godmother.","rating":"6.7","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDRhMGQ1NWMtNmZkNS00MGYxLTg0ZWUtMGRlYmZiMzQ3YTc1XkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"The Cocoon and the Butterfly","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Combination of the Safe","year":1914},{"title":"The Coming of the Padres","year":1914,"description":"When, in 1782, the Rev. Junipero Serra celebrated the first mass in Santa Barbara he little dreamed that almost a century and a half later the incident would be perpetuated to posterity by ...","rating":"N/A","poster":"N/A"},{"title":"Cruel, Cruel Love","year":1914,"description":"A silly aristocrat who believes that he has been jilted attempts suicide but he is saved from death and reunited with his fiancée.","rating":"5.5","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmVlYjZjNDEtOGI2YS00NzVhLWE5MGItYjU4Y2YzM2RkZDM2XkEyXkFqcGdeQXVyNDUzNzExOTE@._V1_SX300.jpg"},{"title":"Damaged Goods","year":1914,"description":"\"Damaged Goods\" pictures the terrible consequences of vice and the physical ruin that follows the abuse of moral law. It is a stirring plea for a pure life before marriage, in order to make...","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWY5YmUxYjYtYmYxYS00ZWExLTkwNmEtOTEzYjRkMjc0YzM1XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_SX300.jpg"},{"title":"David Gray's Estate","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Destinies Fulfilled","year":1914,"description":"Back in '65 there was an old Southern fire eater, Pennington, and his daughter, Lucille, fell in love with Carr who was then a lieutenant in the small Yankee force that arrived in their ...","rating":"N/A","poster":"N/A"},{"title":"Does It End Right?","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Dough and Dynamite","year":1914,"description":"Charlie and another waiter must become bakers when the regular bakers go out on strike. The strikers put dynamite in a piece of bread which is delivered to the cake counter. It winds up in the oven and explodes.","rating":"6.0","poster":"https://m.media-amazon.com/images/M/MV5BZTAxY2JiODgtZmZiMC00ODk0LWJhYWQtYTMyNDUwMWFkYWE2XkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"The Envoy Extraordinary","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Escape","year":1914,"description":"A dramatic comparison between the mating habits of animals and the way humans choose their own partners.","rating":"6.4","poster":"N/A"},{"title":"The Exploits of Elaine","year":1914,"description":"N/A","rating":"6.2","poster":"http://ia.media-imdb.com/images/M/MV5BYjNkMWNmY2YtMTI5Ni00YzkyLWIyMmEtMTE3NjVjOWNmZjZiXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"The Face on the Bar Room Floor","year":1914},{"title":"The Fatal Mallet","year":1914,"description":"Three man will fight for the love of a charming girl. Charlie will play dirty, throwing bricks to his contender, and using a huge hammer to hurt one of them. But a precocious kid will be the fourth suitor in discord.","rating":"5.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU2ODQ1MzEtNDY5MS00M2Q0LWExZTItNmRlMDkzOWFhMWViXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SX300.jpg"},{"title":"Fate's Decree","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Fatty's Magic Pants","year":1914,"description":"'Fatty' is looking forward to attending a formal occasion. But in order to go, he has to be properly dressed, and he encounters unexpected difficulties in getting himself ready.","rating":"5.3","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0OTQwODMzM15BMl5BanBnXkFtZTcwMTM1NzI0NQ@@._V1_SX300.jpg"},{"title":"Feast and Famine","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Film Johnnie","year":1914,"description":"Charlie attempts to meet his favorite movie actress at the Keystone Studio, but does not win friends there.","rating":"5.7","poster":"https://m.media-amazon.com/images/M/MV5BNTMyODA2MWYtNjZiMS00Zjk3LWI2YjgtZjE5ODM4YjUyM2IzXkEyXkFqcGdeQXVyNDUzNzExOTE@._V1_SX300.jpg"},{"title":"The Final Impulse","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Floor Above","year":1914,"description":"English sleuths Grace Burton and Stephen Pryde are in love, but when Stephen inherits wealth and a title, he does not tell Grace, fearing that she will stop loving him. Grace provides ...","rating":"4.5","poster":"N/A"},{"title":"A Florida Enchantment","year":1914,"description":"A young woman discovers a seed that can make women act like men and men act like women. She decides to take one, then slips one to her maid and another to her fiancé. The fun begins.","rating":"6.1","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTM0NTkwOF5BMl5BanBnXkFtZTgwMzE4MzQ4ODE@._V1_SX300.jpg"},{"title":"In the Footprints of Mozart","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Forbidden Room","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Gentlemen of Nerve","year":1914,"description":"Mabel and her beau go to an auto race and are joined by Charlie and his friend. As Charlie's friend is attempting to enter the raceway through a hole, the friend gets stuck and a policeman ...","rating":"5.8","poster":"https://m.media-amazon.com/images/M/MV5BNzNhODg3ZmMtYTcwYi00ZmU1LTg4ZWEtZmUxNWNlMmI4MjAyXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"Gertie the Dinosaur","year":1914,"description":"The cartoonist, Winsor McCay, brings the Dinosaurus back to life in the figure of his latest creation, Gertie the Dinosaur.","rating":"7.2","poster":"https://m.media-amazon.com/images/M/MV5BMTQxNzI4ODQ3NF5BMl5BanBnXkFtZTgwNzY5NzMwMjE@._V1_SX300.jpg"},{"title":"Getting Acquainted","year":1914,"description":"A continuous exchange of meetings between husbands and wives of different couples in which a policeman intrudes in daring chase until both couples are found.","rating":"5.6","poster":"https://m.media-amazon.com/images/M/MV5BMGFlNWFlNGQtNmI4ZC00NzQ1LWE5NzEtZDM3MDYxODdmMWIzXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"The Ghost Breaker","year":1914,"description":"N/A","rating":"3.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTJkODcwYWMtNDg0Ni00ZjIwLWEyNmEtZGM2NmQyMTAwOWMzXkEyXkFqcGdeQXVyMjQ0ODE4OTU@._V1_SX300.jpg"},{"title":"The Girl in the Shack","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Good Little Devil","year":1914,"description":"N/A","rating":"5.7","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDkxNzg4N15BMl5BanBnXkFtZTgwNjI3NjU4MDE@._V1_SX300.jpg"},{"title":"The Green-Eyed Devil","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Happy Coersion","year":1914},{"title":"The Hazards of Helen","year":1914,"description":"N/A","rating":"7.0","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM1OGMxM2EtODQ2MS00N2RhLWJkMWMtNDQ1ZjYzMGYwMmMxXkEyXkFqcGdeQXVyNzI5NjM3NDQ@._V1_SX300.jpg"},{"title":"Her Friend the Bandit","year":1914,"description":"Lost Charles Chaplin's comedy film about her friend.","rating":"5.9","poster":"https://m.media-amazon.com/images/M/MV5BNmZkZjJlODktY2I0ZC00YTNmLThlNjItM2FlNjc2Y2M0Y2RkXkEyXkFqcGdeQXVyNTA2NTExODE@._V1_SX300.jpg"},{"title":"Her Younger Sister","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"His Faith in Humanity","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"His Father's Rifle","year":1914},{"title":"His Favourite Pastime","year":1914},{"title":"His Majesty, the Scarecrow of Oz","year":1914},{"title":"His Musical Career","year":1914,"description":"Charlie and his partner are to deliver a piano to 666 Prospect St. and repossess one from 999 Prospect St. They confuse the addresses. The difficulties of delivering the piano by mule cart,...","rating":"6.1","poster":"https://m.media-amazon.com/images/M/MV5BZGI2OWJlOWEtNjlhNy00N2I2LTk5NDYtZDU1MzY3MzI2YWVhXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"His New Profession","year":1914,"description":"Charlie meets a couple and agrees to care for the man's crippled uncle. After the couple breaks up the man's new girl drops some eggs which Charlie slips on while trying to control the ...","rating":"6.1","poster":"https://m.media-amazon.com/images/M/MV5BMjAxMjE2ODMwNF5BMl5BanBnXkFtZTgwMTAwMTAyMjE@._V1_SX300.jpg"},{"title":"His Prehistoric Past","year":1914,"description":"Charlie dreams he is in the stone age. There King Low-Brow rules a harem of wives. Charlie, in skins and a bowler, falls in love with the king's favorite wife, Sum-Babee. During a hunting ...","rating":"5.4","poster":"https://m.media-amazon.com/images/M/MV5BZjUxODk3NmQtMmRlZi00NmYyLTkwMTItMWEzYmUxYjMzOTkzXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"His Trysting Place","year":1914,"description":"Charlie's wife sends him to the store for a baby bottle with milk. Elsewhere, Ambrose offers to post a love letter for a woman in his boarding house. The two men meet at a restaurant and ...","rating":"6.3","poster":"https://m.media-amazon.com/images/M/MV5BOTE0ODU2NDctNzhlZC00N2VhLWEwY2YtMDYwNjM1MDkyNWJkXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"Home, Sweet Home","year":1914,"description":"John Howard Payne at his most miserable point in life, writes a song which becomes popular and inspires other people at some point in their lives.","rating":"5.9","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNTEyOTY4Ml5BMl5BanBnXkFtZTcwMzg1MDA4Mg@@._V1_SX300.jpg"},{"title":"The Hopes of Blind Alley","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Hunchback","year":1914,"description":"A crippled boy brought up in a thieves' kitchen reforms for love.","rating":"N/A","poster":"N/A"},{"title":"Imar the Servitor","year":1914,"description":"Imar the Servitor rescues an American tourist who has lost his way in the desert and the two men become friends. Before he leaves, the American gives his friend a picture of his fiancée. ...","rating":"N/A","poster":"N/A"},{"title":"In Tune","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"In the Candlelight","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"In the Land of the Head Hunters","year":1914,"description":"In 1911, as part of his massive undertaking, famed Northwest photographer Edward S. Curtis travelled to Vancouver Island, British Columbia, to visit the Kwakwaka'wakw. By the next year, ...","rating":"6.0","poster":"https://m.media-amazon.com/images/M/MV5BMjE3MjAyNzM5NV5BMl5BanBnXkFtZTgwMjA5OTg5NjE@._V1_SX300.jpg"},{"title":"In the Open","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Jail Birds","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Judith of Bethulia","year":1914,"description":"A religious woman seeks to save her people from destruction by seducing and murdering the enemy leader, but her plans get complicated once she falls for him.","rating":"7.3","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NjgzMjY1N15BMl5BanBnXkFtZTcwNjAzMjM5OA@@._V1._CR221.88333129882812,0.5333404541015625,1055,1410.0999603271484_SY132_CR5,0,89,132_AL_.jpg_V1_SX300.jpg"},{"title":"The Jungle","year":1914,"description":"Imagrants' mistreated lives in Chicago","rating":"7.4","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA4ZDA1NDEtNWQ0YS00ZjIzLWE5NmItNGZjNWYxZWM0ZmMwXkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"Kid Auto Races at Venice","year":1914,"description":"The Tramp wanders into and disrupts the filming of a go-kart race.","rating":"5.8","poster":"https://m.media-amazon.com/images/M/MV5BYjBiNTg3M2EtYTdmOS00MzRjLWEzZTctMDYzNTc1Yjk1ZjFkXkEyXkFqcGdeQXVyNDA5Mjg5MjA@._V1_SX300.jpg"},{"title":"The Kiss","year":1914,"description":"N/A","rating":"4.7","poster":"N/A"},{"title":"The Knockout","year":1914,"description":"To show his girl how brave he is Fatty challenges the champion to a fight. Charlie referees, trying to avoid contact with the two monsters.","rating":"5.8","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI5NTIxYTktOTllNy00ZTg3LTlhZmItMDJlMjZjYzkxMTM0XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SX300.jpg"},{"title":"Laughing Gas","year":1914,"description":"Charlie pretends to be a dentist though he is only his assistant. When a patient can't stop laughing from the anesthesia Charlie knocks him out with a club. He is sent to the drug store, ...","rating":"5.8","poster":"https://m.media-amazon.com/images/M/MV5BZmM0YmQ1OGYtM2ZiYi00ODBhLWI2NDMtYzAxOTM0NWMwOTBlXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"The Life of General Villa","year":1914,"description":"The life and career of Panccho Villa from young man to revolutionary leader is chronicled.","rating":"7.2","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzlhY2JjMTctYTBjNS00ZDU5LWE5ODItNThlZGI1MGU5ZWZkXkEyXkFqcGdeQXVyNTUxODQ0MDk@._V1_SX300.jpg"},{"title":"Little Lord Fauntleroy","year":1914,"description":"An American boy turns out to be the long-lost heir of a British fortune. He is sent to live with the cold and unsentimental lord who oversees the trust.","rating":"5.5","poster":"N/A"},{"title":"A Little Madonna","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Livid Flame","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Lost Sermon","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Love and Bullets","year":1914,"description":"N/A","rating":"9.0","poster":"N/A"},{"title":"The Lover's Gift","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Lucille Love, Girl of Mystery","year":1914},{"title":"The Lure of the Sawdust","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Mabel at the Wheel","year":1914,"description":"Charlie, competing with his rival's race car, offers Mabel a ride on his motorcycle but drops her in a puddle. He next joins some dubious characters in abduction of his rival just before ...","rating":"5.8","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzExNDQ3M2YtMzRkOS00M2Q4LTk0OTktNzNiOWIyNTZjMWI4XkEyXkFqcGdeQXVyNDUzNzExOTE@._V1_SX300.jpg"},{"title":"Mabel's Blunder","year":1914,"description":"Mabel is engaged to Harry, the boss's son. The boss has an eye for Mabel too, in this gender-bending comedy of errors and mistaken identities.","rating":"5.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNTM1NTg2M15BMl5BanBnXkFtZTcwMTE3NzQyMw@@._V1._CR122.88333129882812,92.53334045410156,253,324_SY132_CR7,0,89,132_AL_.jpg_V1_SX300.jpg"},{"title":"Mabel's Busy Day","year":1914,"description":"A hotdog girl gives one to a policeman who then allows her into a race track. While other customers swipe her hotdogs, Charlie runs off with the whole box, pretending to sell them while ...","rating":"5.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWU3NDc5Y2QtNjgyNi00ZGYyLWJkMTQtZTZiMTNhNzNjMzJkXkEyXkFqcGdeQXVyNjkyMjkxOTE@._V1_SX300.jpg"},{"title":"Mabel's Married Life","year":1914,"description":"Accosted by a masher in the park and unable to motivate husband Charlie into taking action, Mabel gets him a boxing mannequin to sharpen his fighting skills.","rating":"5.8","poster":"https://m.media-amazon.com/images/M/MV5BOTYxZDUxOWQtOGJmZS00YTg1LTgxMjEtZTI5ZDA2ZmFlYjU4XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SX300.jpg"},{"title":"Mabel's Strange Predicament","year":1914,"description":"In a hotel lobby an inebriated Charlie runs into an elegant lady, gets tied hup in her dog's leash, and falls down. He later runs into her in the hotel corridor, locked out of her room. ...","rating":"5.6","poster":"https://m.media-amazon.com/images/M/MV5BOTc4NTA0OTk3Ml5BMl5BanBnXkFtZTgwNTE1MTkzMjE@._V1_SX300.jpg"},{"title":"The Magic Cloak of Oz","year":1914},{"title":"Making a Living","year":1914,"description":"An out-of-work swindler takes a job as a reporter. After witnessing a car go over cliff, he grabs a rival reporter's camera and races to the newspaper office to enter the photo as his own. ...","rating":"5.5","poster":"https://m.media-amazon.com/images/M/MV5BMjI0Nzg5MjYxMF5BMl5BanBnXkFtZTcwMzgxODQ4Mg@@._V1._CR102,78,253,333_SY132_CR5,0,89,132_AL_.jpg_V1_SX300.jpg"},{"title":"The Man from Home","year":1914,"description":"Wealthy brother and sister Horace and Ethel Simpson, touring Europe, fall prey to Russian conmen, one of whom plans a marriage with Ethel. Executor of their fortune Daniel Pike, assisted by...","rating":"N/A","poster":"N/A"},{"title":"A Man's Way","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Masquerader","year":1914,"description":"Charlie is an actor in a film studio. He messes up several scenes and is tossed out. Returning dressed as a lady, he charms the director. Even so, Charlie never makes it into film, winding up at the bottom of a well.","rating":"6.0","poster":"https://m.media-amazon.com/images/M/MV5BM2VkOTY4N2EtNmMyOS00M2I0LThmZDktOWZlMDM0N2QyZTNiXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"The Master Key","year":1914,"description":"N/A","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGVkMTcyNzItOWI4YS00YWEzLWIwZTItM2ZmZTYyZmM5Y2I4XkEyXkFqcGdeQXVyMzAyNDIwNzY@._V1_SX300.jpg"},{"title":"The Master Mind","year":1914,"description":"The defense attorney who was unable to obtain the acquittal of an innocent young man concocts a complicated and diabolical scheme to revenge himself upon the prosecutor.","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWIzYjc2MTYtYjJmNy00MDNkLWFhMmEtZjRmYzRhNWE2NjgxXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"Mein Lieber Katrina","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Michael Strogoff","year":1914,"description":"The Russian Czar sends his trusted confidant, Michael Strogoff, to warn his brother the Grand Duke of a Tartar rebellion that will be led by Feofar Khan and Ivan Ogareff. Calling himself ...","rating":"6.4","poster":"N/A"},{"title":"Mein Lieber Katrina Catches a Convict","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Mrs. Wiggs of the Cabbage Patch","year":1914,"description":"Mrs. Wiggs, a loving mother whose husband has abandoned her, supports her many children and lives in hope of her husband's return.","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODVkNTc0ZjctNGNlNC00NjRjLThmODAtNDYyNDdmMWYxMDBjXkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"The Mystery of the Hindu Image","year":1914,"description":"N/A","rating":"6.6","poster":"N/A"},{"title":"Nature's Touch","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Navy Aviator","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Neptune's Daughter","year":1914,"description":"The daughter of King Neptune determines to avenge the death of her sister, who was caught in a fishing net laid by the king of a country above the waves. However, she soon falls in love ...","rating":"5.9","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0NDA0Nzc5NDheQTJeQWpwZ15BbWU4MDkwNTgyNzMx._V1_SX300.jpg"},{"title":"The New Janitor","year":1914,"description":"Charlie is janitor for a firm the manager of which receives a threatening note about his gambling debts. He throws a bucket of water out the window which lands on his boss and costs him his...","rating":"6.1","poster":"https://m.media-amazon.com/images/M/MV5BNjZkYjA0NTEtOWJhNS00MmY0LTlhYjUtMzg2MzNmMTE3NDJjXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"Old Enough to Be Her Grandpa","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Only Son","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Patchwork Girl of Oz","year":1914,"description":"Ojo and Unc Nunkie are out of food, so they decide to journey to the Emerald City where they will never starve. Along the way, they meet Mewel, a waif and stray (mule) who leads them to Dr....","rating":"5.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDExMTUwNV5BMl5BanBnXkFtZTcwOTAyODkxMQ@@._V1_SX300.jpg"},{"title":"The Perils of Pauline","year":1914,"description":"Young Pauline is left a lot of money when her wealthy uncle dies. However, her uncle's secretary has been named as her guardian until she marries, at which time she will officially take ...","rating":"7.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgxODk1Mzk2Ml5BMl5BanBnXkFtZTgwMDg0NzkwMjE@._V1_SX300.jpg"},{"title":"The Power of Light","year":1914,"description":"Cliff Jackson, the eighteen-year-old son of a mountaineer, is possessed of a strong determination to conquer his father, who operates an illicit still, as then through the strong arm of the...","rating":"N/A","poster":"N/A"},{"title":"The Property Man","year":1914,"description":"Charlie has trouble with actors' luggage and conflicts over who gets the star's dressing room. There are further difficulties with frequent scene changes, wrong entries and a fireman's hose...","rating":"5.9","poster":"https://m.media-amazon.com/images/M/MV5BZTAwZDhkODMtNGRlZi00OWViLWI3OGQtNWM1MjMwNWQ3YjI0XkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"Recreation","year":1914,"description":"Charlie is walking in the park. A girl leaves a seaman on one bench and joins Charlie on another. The seaman wakes up. He and Charlie stage a brick fight. Policemen get hit and arrest both ...","rating":"5.1","poster":"https://m.media-amazon.com/images/M/MV5BNmU3OTg4NmEtOGMwOC00ZDc1LWI4MDQtYmFkZTM4MTQwYzQwXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"Redbird Wins","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Redemption of a Pal","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Richelieu","year":1914,"description":"With the opening of the story Richelieu pardons the Duke of Orleans and all his followers in the Languedoc revolt, save one. The exception is Adrien de Mauprat, because he seized a French ...","rating":"N/A","poster":"https://m.media-amazon.com/images/M/MV5BYWEwYmQ2YTktMjM1Ni00ZDM1LWJhZTgtNDNlZjdiNGU0NWZhXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"The Rose Bush of Memories","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Rose of the Rancho","year":1914,"description":"Esra Kincaid takes land by force and, having taken the Espinoza land, his sights are set on the Castro rancho. US government agent Kearney holds him off till the cavalry shows up and he can...","rating":"3.7","poster":"N/A"},{"title":"Rosemary, That's for Remembrance","year":1914,"description":"Dorinda, a mountain girl, left alone by the death of her parents, is adopted by distant relatives, Mr. and Mrs. Greer. Mrs. Greer is not overjoyed by this addition to their family, because ...","rating":"N/A","poster":"N/A"},{"title":"The Rounders","year":1914,"description":"Two drunks live in the same hotel. One beats his wife, the other is beaten by his. They go off and get drunk together. They try to sleep in a restaurant using tables as beds and are thrown ...","rating":"6.4","poster":"https://m.media-amazon.com/images/M/MV5BMjI2Mzg2MzE0Nl5BMl5BanBnXkFtZTgwNTA5NDYyMjE@._V1_SX300.jpg"},{"title":"Salomy Jane","year":1914,"description":"When beautiful Salomy Jane resists the romantic advances of a young ruffian, she is rescued by Jack Dart, who has his own additional reasons for tangling with the man. Jack fights the ...","rating":"6.0","poster":"N/A"},{"title":"Samson","year":1914,"description":"N/A","rating":"5.5","poster":"N/A"},{"title":"Shotgun Jones","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Should a Woman Divorce?","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Sir Galahad of Twilight","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Sleeping Sentinel","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Slice of Life","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Son of Thomas Gray","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Song of the Sea Shell","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Soul Astray","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Sower Reaps","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Sparrow of the Circus","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Spoilers","year":1914,"description":"The first of many filmed adaptations of Rex Beach's adventure novel of the Alaskan gold-rush.","rating":"6.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDlhM2QyMzUtN2FhNS00ZjEwLWE1YzktOTA3NDE1ZjcxNmMwXkEyXkFqcGdeQXVyNjc4NTQxNjg@._V1_SX300.jpg"},{"title":"The Squaw Man","year":1914,"description":"A chivalrous British officer takes the blame for his cousin's embezzlement and journeys to the American West to start a new life on a cattle ranch.","rating":"6.2","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODQwODI3Nl5BMl5BanBnXkFtZTgwMDA1ODI3MzE@._V1_SX300.jpg"},{"title":"The Star Boarder","year":1914,"description":"A brat's magic lantern show exposes an indiscreet moment between a landlady and her star boarder.","rating":"5.4","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0Nzg5MjYxMF5BMl5BanBnXkFtZTcwMzgxODQ4Mg@@._V1._CR102,78,253,333_SY132_CR5,0,89,132_AL_.jpg_V1_SX300.jpg"},{"title":"A Story of Little Italy","year":1914,"description":"Tony, a product of one of the gangs of the Italian quarter, is released from a country institutional farm, fully determined to be a good man. But old associations, and the ridicule of his ...","rating":"N/A","poster":"N/A"},{"title":"The Story of the Olive","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Strength o' Ten","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Study in Scarlet","year":1914,"description":"N/A","rating":"5.2","poster":"N/A"},{"title":"Sweet and Low","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Such a Little Queen","year":1914,"description":"Robert Trainor, an American, aids in the romance of the Queen of Herzegovina and the King of Bosnia.","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDhjNTM1OTAtNTZmMy00ODQzLTk3ZDUtNmQ4Nzc5YzEyMzJkXkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"The Taming of Sunnybrook Nell","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Tango Tangles","year":1914},{"title":"The Telltale Knife","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Ten of Spades","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Tess of the Storm Country","year":1914,"description":"A wealthy resident attempts to dispossess squatters who live near his home, which leads to a false accusation of murder.","rating":"6.5","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjgwMTllNTktN2FmNC00N2I1LTkzYzgtMWY2YjIxZmY2YWZjXkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"Their Worldly Goods","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"This Is th' Life","year":1914},{"title":"Those Love Pangs","year":1914,"description":"Charlie and a rival vie for the favors of their landlady. In the park they each fall for different girls, though Charlie's has a male friend already. Charlie considers suicide, is talked ...","rating":"5.5","poster":"https://m.media-amazon.com/images/M/MV5BMDllZDNjOWQtNTE0ZS00M2MzLTkwMGYtZDU3MGE5YzNkYjAwXkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"A Ticket to Red Horse Gulch","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Tillie's Punctured Romance","year":1914,"description":"A con man from the city dupes a wealthy country girl into marriage.","rating":"7.0","poster":"https://m.media-amazon.com/images/M/MV5BMTc5MTQwODc0NF5BMl5BanBnXkFtZTgwMTM0NzkxMjE@._V1_SX300.jpg"},{"title":"To Be Called For","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Town of Nazareth","year":1914,"description":"Rosney, as a young man, is jilted by the girl he loves, in favor of another. As years roll by he keeps an ever watchful eye over the welfare of the girl, Mary, at the same time achieving ...","rating":"N/A","poster":"N/A"},{"title":"True Western Hearts","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Turn of the Cards","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Twenty Minutes of Love","year":1914,"description":"Charlie is hanging around in the park, finding problems with a jealous suitor, a man who thinks that Charlie has robbed him a watch, a policeman and even a little boy, all because our friend can't stop snooping.","rating":"5.8","poster":"https://m.media-amazon.com/images/M/MV5BMTdiYjVmYzMtZTk4OC00OWU0LThkODEtMjEzZjI0NTgxODQyXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SX300.jpg"},{"title":"Uncle Tom's Cabin","year":1914,"description":"A black and white silent film based on Harriet Beecher Stowe's novel documenting the life and times of Uncle Tom.","rating":"5.5","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjIwODU3ZTEtOTM3Yy00YjY4LWE4NjMtNWI1Yjk4ZDQ3MjNiXkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"The Unlawful Trade","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Unmasking","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Unto the Weak","year":1914,"description":"Alone at the edge of the village, and not far from the mill race and the old bridge, lived Peter - his last name is of no consequence. With aid for the needy and a helping hand for the weak...","rating":"N/A","poster":"N/A"},{"title":"The Virginian","year":1914,"description":"A good-natured but chivalrous cowboy romances the local schoolmarm and leads the posse that brings a gang of rustlers, which includes his best friend, to justice.","rating":"5.8","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGZhNDE2MWMtZWQyNy00ZjllLThjOGQtMTFjZGRjNGExZmU3XkEyXkFqcGdeQXVyNDk0MDM0Mzg@._V1_SX300.jpg"},{"title":"What's His Name","year":1914,"description":"Soda jerk Harvey is the most popular man in Blakeville NY and deliriously happy through three years of poverty-stricken marriage to Nellie. After a musical comedy troupe comes through ...","rating":"4.8","poster":"N/A"},{"title":"When a Woman Waits","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Widow's Investment","year":1914,"description":"James Waldo, finding himself financially embarrassed, decides to form a fake oil company and sell stock. He forms a partnership with Henry Morgan, who is unprincipled as himself. They go to...","rating":"N/A","poster":"N/A"},{"title":"Wildflower","year":1914,"description":"N/A","rating":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BZGU0Y2MyOTUtOWYyZS00Y2E0LTkwNTctMjI3MThmZDU1MzU2XkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"The Wishing Ring","year":1914,"description":"After being expelled from college, Giles runs away from home and meets a young lady who he falls for.","rating":"6.5","poster":"https://m.media-amazon.com/images/M/MV5BYTM1OWY1NmUtYTA1OS00MjlhLWE4ODctZjQxZGMyYjIxZDFjXkEyXkFqcGdeQXVyMTY2MDM3MTk@._V1_SX300.jpg"},{"title":"The Wrath of the Gods","year":1914,"description":"An American sailor falls in love with a fisherman's daughter and convinces her that Jesus is more powerful than the gods who have cursed her.","rating":"5.7","poster":"https://m.media-amazon.com/images/M/MV5BMjI0OGQwODMtZWQ3Ny00ZjBjLWIyZmEtOWI4NmFjMjk4MGNkXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"The Wrong Birds","year":1914,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Absentee","year":1915,"description":"The Prologue shows man as 'Power,' garbed in Greek-classic costume, standing at the parting of life's highway. One road leads to 'Success' - the other to ''Failure'. He (Power) is ...","rating":"N/A","poster":"https://m.media-amazon.com/images/M/MV5BM2QyMTVlNzAtY2JmMy00NWU2LWIzYWMtMTNkNDNkZGE4Y2IxXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"After Dark","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"After Five","year":1915,"description":"Ted Ewing, a young New Yorker, is the guardian of Nora Hildreth, with whom he is in love. He invests her fortune of $50,000 and an equal amount of his own money (constituting almost his ...","rating":"4.0","poster":"https://m.media-amazon.com/images/M/MV5BMTUwNjY3ODg0OV5BMl5BanBnXkFtZTYwMjI4NDc4._V1_SX300.jpg"},{"title":"Alias Jimmy Valentine","year":1915,"description":"After robbing a bank, a criminal is wrongfully pardoned from prison.","rating":"6.2","poster":"https://m.media-amazon.com/images/M/MV5BMzJiZWJlOGEtZjcwYi00ZDExLWFlNTgtMDE0Nzg1YjA0MDZmXkEyXkFqcGdeQXVyODc1NDEwNzQ@._V1_SX300.jpg"},{"title":"The Alster Case","year":1915,"description":"Miss Cornelia Alster, a wealthy spinster, secretly makes George Swan, a poor lawyer's clerk, executor of her estate. That night, she goes to a theatre and returns home unexpectedly, ...","rating":"N/A","poster":"https://m.media-amazon.com/images/M/MV5BNzAyNGE5YTgtMTFhNS00MWJkLTk5NWUtMjQ2YTE2NDllYmRlXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"Always in the Way","year":1915,"description":"Four-year-old Dorothy, the daughter of rich lawyer Winfred North, is inconsolable over the recent death of her mother. Her father, too absorbed with business to pay attention to his ...","rating":"N/A","poster":"https://m.media-amazon.com/images/M/MV5BNTgwMjQ5YjktYzk1Ni00YmFlLTg2OGYtMDhiNGY0ZTMyYmIxXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"An Affair of Three Nations","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Anna Karenina","year":1915,"description":"N/A","rating":"5.6","poster":"N/A"},{"title":"Anselo Lee","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Apaches of Paris","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Arab","year":1915,"description":"An old sheik punishes his son Jamil for robbing a caravan by giving his horse to the wronged merchant. The horse is sold to a Turkish general then given to a Christian missionary Mary ...","rating":"5.7","poster":"https://m.media-amazon.com/images/M/MV5BMjE5MjI3MTI1OF5BMl5BanBnXkFtZTYwODAzNzk5._V1_SX300.jpg"},{"title":"Are You a Mason?","year":1915,"description":"Frank Perry's wife Helen is away visiting her mother, and he uses this \"free time\" for a night of drinking at a nightclub. Unfortunately, when he tries to return home, he enters the wrong ...","rating":"7.3","poster":"https://m.media-amazon.com/images/M/MV5BYjBjZjNlMGQtOTAyNS00YjQxLWI4ZjMtYjU0MDE2MWZhNDQxXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"Armstrong's Wife","year":1915,"description":"Gambler Harvey Arnold is forced to leave San Francisco and winds up in a small country town that is in the midst of a reform movement. He marries a local girl, May Fielding, who has no idea...","rating":"N/A","poster":"https://m.media-amazon.com/images/M/MV5BNTdmYWQ3NjMtN2IzMC00MmY5LTgxN2UtMzgxOGM2MjdiYWZiXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SX300.jpg"},{"title":"At Bay","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Barbara Frietchie","year":1915,"description":"Barbara Frietchie's eighteenth birthday is interrupted when she sees Union soldiers, who have taken control of her home town, Frederick, Maryland, foraging for food. Her screams bring ...","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzA0ZGEwYzktZmU5Yy00NDAyLWIxYWQtYTU3OGRkYzQ2YzYzXkEyXkFqcGdeQXVyMjYzMDY1NTg@._V1_SX300.jpg"},{"title":"The Barnstormers","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Battle Cry of Peace","year":1915,"description":"Enemy agents under the leadership of \"Emanon\" conspire with pacifists to keep the American defense appropriations down at a time when forces of the enemy are preparing to invade. The ...","rating":"3.5","poster":"N/A"},{"title":"The Beachcomber","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Bella Donna","year":1915,"description":"Bella Donna falls for the exotic Baroudi and plots to poison her husband.","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWZlMmU4MTYtNzZkOS00MmNlLThhYzAtNzBjM2M0ZDk4YjgyXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"The Beloved Vagabond","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Betty in Search of a Thrill","year":1915,"description":"When Betty arrives from the Convent to visit her uncle's family they are careful to hide all the extreme low-necked gowns and other worldly things lest they shock the devout convent girl. ...","rating":"N/A","poster":"N/A"},{"title":"Between Men","year":1915,"description":"When Ashley Hampdon becomes the target of a scheme to ruin him by his daughter's suitor, Hampdon sends for his old friend Bob White. Bob discovers that the suitor, Gregg Lewiston, cannot ...","rating":"N/A","poster":"N/A"},{"title":"The Bigger Man","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Birth of a Nation","year":1915,"description":"The Stoneman family finds its friendship with the Camerons affected by the Civil War, both fighting in opposite armies. The development of the war in their lives plays through to Lincoln's assassination and the birth of the Ku Klux Klan.","rating":"6.6","poster":"https://m.media-amazon.com/images/M/MV5BYTM4ZDhiYTQtYzExNC00YjVlLTg2YWYtYTk3NTAzMzcwNTExXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SX300.jpg"},{"title":"Black Fear","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Black Sheep","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Blackbirds","year":1915,"description":"N/A","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTlmNDc4MDAtOTIyMC00OTFmLWEzODQtYmVmOWI3ZDAyZGIwXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"Blindness of Devotion","year":1915,"description":"Fortune-hunting Renee Delaveaux marries the Count de Carney to get her hands on his money. But she falls into a liaison with the Count's ward, Pierre Cavereaux, a handsome young soldier. ...","rating":"N/A","poster":"N/A"},{"title":"The Blindness of Virtue","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Body and Soul","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Boss","year":1915,"description":"N/A","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2M5MDk5MzUtZjhhZi00NjA1LWI1MTctMGU4MGM3YTg1OTVlXkEyXkFqcGdeQXVyNjYyNjE5MjY@._V1_SX300.jpg"},{"title":"The Broken Law","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Buckshot John","year":1915,"description":"A sheriff and his posse shoot it out with a gang of robbers headed by Bad Jake Kennedy. The surviving robber, Buckshot John, won't tell where the gang's loot is hidden and gets 30 years in ...","rating":"N/A","poster":"N/A"},{"title":"Business Is Business","year":1915,"description":"Newly wealthy Isidore Lechat lives in a castle in the south of France. He believes that business is the most important thing in life, but manages to stay attached to his children, although ...","rating":"N/A","poster":"N/A"},{"title":"A Butterfly on the Wheel","year":1915,"description":"N/A","rating":"6.9","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGFhMmM2M2UtZGY5Mi00Y2NiLThkNmYtMjM4NzZjZDllYjIzL2ltYWdlXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"The Buzzard's Shadow","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Camille","year":1915,"description":"Camille is a courtesan in Paris. She falls deeply in love with a young man of promise, Armand Duval. When Armand's father begs her not to ruin his hopes of a career and position by marrying...","rating":"4.9","poster":"N/A"},{"title":"The Caprices of Kitty","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Captain Courtesy","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Captive","year":1915,"description":"With her brother killed Sonya is given Turkish captive Mahmud to do the hard work on the farm. After they become fond of each other he strikes a Turkish officer. When peace arrives, his ...","rating":"6.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTczMjQ0NDgtYzBiOC00ZDBkLThmZTYtNThkMTA4NTAwMmIyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjYzNTM3Nzk@._V1_SX300.jpg"},{"title":"Carmen","year":1915,"description":"In order to help her smuggler kinsmen, a sultry gypsy seduces and corrupts an officer of the Civil Guard turning him into a traitor and murderer.","rating":"6.9","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MzkwMTkzNl5BMl5BanBnXkFtZTgwNTgwMTYxMjE@._V1_SX300.jpg"},{"title":"Carmen","year":1915,"description":"In order to help her smuggler kinsmen, a sultry gypsy seduces and corrupts an officer of the Civil Guard turning him into a traitor and murderer.","rating":"6.9","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MzkwMTkzNl5BMl5BanBnXkFtZTgwNTgwMTYxMjE@._V1_SX300.jpg"},{"title":"The Carpet from Bagdad","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Case of Becky","year":1915,"description":"When a young girl is placed under hypnotism, it's discovered that she has a split personality.","rating":"N/A","poster":"N/A"},{"title":"The Caveman","year":1915},{"title":"The Celebrated Scandal","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Chalice of Courage","year":1915,"description":"Fearing James Armstrong, a former suitor, Louise Newbold. accompanies her husband William on a trip to the Colorado Rockies. While riding a mountain trail, Louise and her horse fall over a ...","rating":"N/A","poster":"N/A"},{"title":"The Cheat","year":1915,"description":"A venal, spoiled stockbroker's wife impulsively embezzles $10,000 from the charity she chairs and desperately turns to a Burmese ivory trader to replace the stolen money.","rating":"6.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjcxNTM5M15BMl5BanBnXkFtZTgwMzgwNjQ1MjE@._V1_SX300.jpg"},{"title":"Children of the Ghetto","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Chimmie Fadden","year":1915,"description":"Bowery hooligan Chimmie is saved from false arrest by socialite dogooder Fanny. She takes in him, his brother and mother as servants. His brother schemes to steal the good lady's silver.","rating":"N/A","poster":"N/A"},{"title":"Chimmie Fadden Out West","year":1915,"description":"Chimmie is sent to Death Valley CA as part of a railroad scheme. He's to pretend to have discovered gold there, then set a new transcontinental record heading east. It doesn't quite work out that way.","rating":"3.3","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjM4ZjU3M2MtMGU1My00YTIyLTljZTYtNGQ3NTg0MDNjZTNlL2ltYWdlXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"The Chorus Lady","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Christmas Memories","year":1915,"description":"An assortment of Christmastime memories all wrapped up in the 8mm and 16mm films of a bygone era.","rating":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTc0MTQxODM5MV5BMl5BanBnXkFtZTgwMDAzOTk1MDE@._V1_SX300.jpg"},{"title":"The Circular Staircase","year":1915,"description":"N/A","rating":"N/A","poster":"https://m.media-amazon.com/images/M/MV5BOGRhZDk4ZDItZWY1Mi00ZmQ4LWJiNjAtOTcxNmMzYThiZDhkXkEyXkFqcGdeQXVyNzk3ODM4NQ@@._V1_SX300.jpg"},{"title":"The Clemenceau Case","year":1915,"description":"Bara as the wife-vampire - her third picture.","rating":"N/A","poster":"https://m.media-amazon.com/images/M/MV5BNGY3YjhkYzAtZjhkMS00NGUwLWFmM2YtOGE2MmZkMDY3NzFlXkEyXkFqcGdeQXVyMDgyNjA5MA@@._V1_SX300.jpg"},{"title":"The Closing Net","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Clue","year":1915,"description":"N/A","rating":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BYjk5Y2ZmZGItYzdlZS00OGM0LWE1ZTEtZWYzZjg5MDNhMWRiXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"Cohen's Luck","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The College Orphan","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Colorado","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Commanding Officer","year":1915,"description":"When Colonel Archer, the military post commanding officer, refuses to loan money to his second-in-command, Captain Waring, Waring gets the money from Brent Lindsay of the nearby mining town...","rating":"N/A","poster":"N/A"},{"title":"The Commuters","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Comrade John","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Conscience","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Cora","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Coral","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Country Boy","year":1915,"description":"Tom, a young man in a small town, wants to marry his sweetheart Jane, but Jane's father won't allow it until Tom proves he can support her. Tom heads to New York City to make his fortune ...","rating":"N/A","poster":"N/A"},{"title":"Courtmartialed","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Coward","year":1915,"description":"Confederate soldier Frank Winslow is terrified of the war and eventually runs away from battle. But when he finds himself behind enemy lines with vital information, he must decide between ...","rating":"6.1","poster":"https://m.media-amazon.com/images/M/MV5BMjE5MzQ5NTMyNF5BMl5BanBnXkFtZTgwNjkwOTMyMjE@._V1_SX300.jpg"},{"title":"The Cowardly Way","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Cowboy and the Lady","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Crimson Wing","year":1915,"description":"Count Ludwig von Leun-Walram, a German army officer, meets Marguerite Clairon, an actress, while at a watering place on the border line of France. She falls in love with him and reveals her...","rating":"N/A","poster":"N/A"},{"title":"Crooky","year":1915,"description":"N/A","rating":"N/A","poster":"https://m.media-amazon.com/images/M/MV5BMmU3YzJlYjAtNGNjOS00YzZhLTgzZGMtYzBjM2JhZDk1YTQ4XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"Cross Currents","year":1915,"description":"Washington, D.C. society belle Elizabeth Crane gives up her fiance, young diplomat Paul Beale, when she learns that her foster sister Flavia also loves him. After Flavia and Paul marry, ...","rating":"5.0","poster":"N/A"},{"title":"The Crown Prince's Double","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Cub","year":1915,"description":"N/A","rating":"6.2","poster":"N/A"},{"title":"The Cup of Life","year":1915,"description":"Sisters Helen and Ruth Fiske work in a department store and live in an East Side tenement. While Ruth is satisfied with her \"regular fellow,\" a mechanic, Helen yearns for fine clothes, ...","rating":"N/A","poster":"N/A"},{"title":"The Dancing Girl","year":1915,"description":"Drusilla Ives, a young Quaker girl living on an isolated island, leaves to become the servant of the spendthrift Duke of Guisenberry in London, who is the Lord of her village. She finds ...","rating":"N/A","poster":"N/A"},{"title":"The Darkening Trail","year":1915,"description":"Yukon Ed has asked saloon owner Ruby McGraw to marry him several times, and has been turned down each time. However, she falls for Jack Sturgess, a no-account who has seduced and abandoned ...","rating":"6.1","poster":"https://m.media-amazon.com/images/M/MV5BOWFiNTMzNzMtNTE1OS00Yjg3LTkxMTUtMWJhYWQ1NDY0OGU3XkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"A Daughter of the City","year":1915,"description":"Margaret Fowler is a daughter of the city. Her mother, mean and avaricious, ground down to poverty, is willing to sacrifice her daughter's happiness and love for wealth and position. The ...","rating":"N/A","poster":"N/A"},{"title":"David Harum","year":1915,"description":"The story of David Harum, a small-town banker, and how what he does and who he is affects the lives of everyone in his town, whether they--or he--realize it.","rating":"5.9","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZiMzNmMTQtODAyYS00YzU4LWE2OTQtMDk4NmMzZjA5N2U3XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"The Dawn of a Tomorrow","year":1915,"description":"A young girl who lives in the slums of London, is in love with a cunning thief. She persuades him to give up his life of crime. Meanwhile, an eccentric millionaire, who has been diagnosed ...","rating":"6.8","poster":"http://ia.media-imdb.com/images/M/MV5BMWUwYzE4ZDQtYmI2OC00NjNkLWJhMjQtYWIzOGRhNzdlMDM2XkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"The Deep Purple","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Despoiler","year":1915,"description":"In war-torn Europe, Colonel Damien seizes an enemy town, then to persuade the defeated soldiers to give up their ill-gotten money, the Emir of Balkania, commander of the supporting native ...","rating":"N/A","poster":"https://m.media-amazon.com/images/M/MV5BOGRjNWYwNWYtYjlmZi00ZDNjLTk1NDQtYzQxZjRmNGZmZmIwXkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"Destiny","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Destroying Angel","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Destruction","year":1915,"description":"Fernande marries a man and schemes to get his wealth when his expected death occurs. But he dies before he can change his will. She next tries to kill the son who inherits, but he outfoxes her.","rating":"7.8","poster":"https://m.media-amazon.com/images/M/MV5BMWE0YzM4YTQtOGMxYi00ZGI0LWI2MDQtZWZhZGFkNjQ3ZDM2XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"The Devil's Daughter","year":1915,"description":"When her lover deserts her, Gioconda Dianti seeks revenge by wrecking the lives of other men. When Lucio Settala, a famous sculptor, meets Gioconda and asks her to pose for him, she sets ...","rating":"6.0","poster":"https://m.media-amazon.com/images/M/MV5BMDkzYmYxY2MtZWMyYS00MzNhLWFkMGYtZjJkNzcxYmJlMjMwXkEyXkFqcGdeQXVyMTcyODY2NDQ@._V1_SX300.jpg"},{"title":"The Dictator","year":1915,"description":"Brooke Travers, a young society man of a roving disposition and much leisure, gets into a cab with his valet and his trunks, to go to his yacht for a cruise. Arriving at the pier, the ...","rating":"8.0","poster":"https://m.media-amazon.com/images/M/MV5BZTI3M2IwMzktYzQ0ZS00MjNhLWI2ZWMtZDE1M2JmZDRmMmQ5XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"The Disciple","year":1915,"description":"Jim Houston, the \"Shootin' Iron\" Parson, comes to Barren Gulch to reform the morals of the frontier community. He receives the support of \"Birdshot\" Bivens, the sheriff of the county. Jim's...","rating":"6.7","poster":"https://m.media-amazon.com/images/M/MV5BOThmMWNhNjEtOGZkOS00ZTJkLThlMDEtZTRhOGIyNTM1ZjQ0XkEyXkFqcGdeQXVyNDk0MDM0Mzg@._V1_SX300.jpg"},{"title":"Don Quixote","year":1915,"description":"Alonso Quijano is a country gentleman who imagines himself to be a knight named Don Quixote de la Mancha. He sets out to right the wrongs of the world which sees him as he is, a comical ...","rating":"5.4","poster":"N/A"},{"title":"Double Trouble","year":1915,"description":"Banker Florian Amidon, a somewhat shy and timid young man, is assaulted, robbed and knocked out while on vacation. When he wakes up he discovers that he's in the booming oil town of ...","rating":"5.0","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2ExNWE1MDUtNTcwOS00NDMwLTg5MWUtMjM2MGI1MzJiZDkyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"Dr. Rameau","year":1915,"description":"Pierre Rameau, the son of a poor gate-keeper, becomes the foremost physician and surgeon in Paris. Conchita, his wife who he loves above everything else in the world, dies leaving an infant...","rating":"N/A","poster":"N/A"},{"title":"The Dust of Egypt","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Earl of Pawtucket","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Edge of the Abyss","year":1915,"description":"N/A","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjNhZGE5NjctNjhhOC00ZDBlLTllYzktODk0MmJjNzZlNjkyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_SX300.jpg"},{"title":"Emmy of Stork's Nest","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"An Enemy to Society","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Enoch Arden","year":1915,"description":"Seamen Enoch Arden returns home after a long absence marooned on a desert island. At home he finds his wife married to another, and though he loves her, he cannot bear to disrupt her ...","rating":"6.2","poster":"http://ia.media-imdb.com/images/M/MV5BMjAwMTQyNDc3MV5BMl5BanBnXkFtZTgwNDY0NTk5MzE@._V1._CR52,53,984,749_SY132_CR42,0,89,132_AL_.jpg_V1_SX300.jpg"},{"title":"The Eternal City","year":1915,"description":"Leone, a Papal guard, is devastated when his wife drowns herself after mistakenly thinking that he had abandoned her. He turns over his son David to be brought up by nuns, then enters a ...","rating":"4.2","poster":"N/A"},{"title":"The Explorer","year":1915,"description":"N/A","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmM4Y2M0MGEtYzU4Yi00NzY3LWFmMTktYmE1OGVhMzNiMzFmXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SX300.jpg"},{"title":"An Eye for an Eye","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Face in the Moonlight","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Fairy and the Waif","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Family Cupboard","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Family Stain","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Fanchon, the Cricket","year":1915,"description":"A young wild girl Fanchon ( Mary Pickford ) lives in a forest with her eccentric grandmother who is suspected by the villagers of being a witch. The unkempt Fanchon suffers from her ...","rating":"6.4","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWUwZWFjYzgtMjJhMy00NDFkLWJhYTItOWU1MWUzYTYwOTBhXkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"The Fatal Card","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Father and the Boys","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Fatherhood","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Fighting Bob","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Fighting Hope","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Final Judgment","year":1915,"description":"Actress Jane Carleson has three admirers: Henry Strong (a millionaire), Hamilton Ross (a chemist), and Murray Campbell (a district attorney). When Jane weds Campbell, Ross writes an ...","rating":"N/A","poster":"https://m.media-amazon.com/images/M/MV5BMzM3M2QyY2MtM2Y1ZS00MjEzLWE4YWYtYTE3MzIzZTI4NjNlXkEyXkFqcGdeQXVyNjgyNTk4NTY@._V1_SX300.jpg"},{"title":"The Flaming Sword","year":1915,"description":"N/A","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWIzNmUwZWUtODQ1YS00YmE5LWI4NDgtMDg0OThmOWIzMGJjXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"The Flash of an Emerald","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Fool There Was","year":1915,"description":"A married diplomat falls hopelessly under the spell of a predatory woman.","rating":"5.9","poster":"https://m.media-amazon.com/images/M/MV5BYWY1M2RiZjYtZWJkMy00YWY5LWFjM2MtOWI5NDgzNWU0NDQ1XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"The Foundling","year":1915,"description":"N/A","rating":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BZTg1MGNkNDUtOWRhYy00MTgzLWJjMjctZjMwYjM5YTllOTViXkEyXkFqcGdeQXVyNDY1NzU5NjY@._V1_SX300.jpg"},{"title":"Four Feathers","year":1915,"description":"N/A","rating":"7.3","poster":"N/A"},{"title":"The Frame-Up","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"From the Valley of the Missing","year":1915,"description":"A baby is left on the Brimecomb's yacht, while they were sailing up the Hudson River, and they adopt him and name him Everett. They are neighbors of Governor Floyd Vandecar whose twin ...","rating":"N/A","poster":"N/A"},{"title":"The Galley Slave","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Gambier's Advocate","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Garden of Lies","year":1915,"description":"An American girl marries the prince of a small European country. On their wedding day, the couple is involved in a car accident, the result of which is that the new bride suffers amnesia ...","rating":"N/A","poster":"N/A"},{"title":"The Gentleman from Indiana","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"A Gentleman of Leisure","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Ghosts","year":1915,"description":"N/A","rating":"5.4","poster":"N/A"},{"title":"A Gilded Fool","year":1915,"description":"N/A","rating":"7.5","poster":"N/A"},{"title":"The Girl from His Town","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Girl I Left Behind Me","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Girl of the Golden West","year":1915,"description":"Road agent Ramerrez hides out in his girlfriend's store where the Sheriff knows him to be. The Sheriff plays The Girl a game of cards to decide Ramerrez's future. She wins. She later saves him from a hanging. She rides off with him.","rating":"4.8","poster":"N/A"},{"title":"A Girl of Yesterday","year":1915,"description":"A girl with old-fashioned values becomes a modern sophisticate.","rating":"N/A","poster":"N/A"},{"title":"Gladiola","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Goddess","year":1915,"description":"A young girl is reared on a desert island by natives and led to believe that she is a goddess. One day an outsider comes to the island, and persuades her to accompany him to preach about ...","rating":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BYTljYzdkMDMtZTYwNS00N2JmLWFjY2MtMGFjMmZlMDAxMjFjXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SX300.jpg"},{"title":"The Golden Chance","year":1915,"description":"Mary Denby becomes a seamstress after her husband Steve wastes their money on booze. Her employer provides her as an escort to accompany millionaire Roger Manning. Her husband tries ...","rating":"6.7","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NjkzMjA5MF5BMl5BanBnXkFtZTcwMjI2MjEzMQ@@._V1_SX300.jpg"},{"title":"The Golden Claw","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Goose Girl","year":1915,"description":"Count von Herbeck, chancellor to the Grand Duke of Ehrenstein, is married but keeps it a secret because of his high ambitions. His dying wife writes him a letter urging him to make their ...","rating":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTY3NTEyNzUyMl5BMl5BanBnXkFtZTYwMjQxODQ5._V1_SX300.jpg"},{"title":"The Governor's Lady","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Graustark","year":1915,"description":"N/A","rating":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMjIzOTEyNjcyNF5BMl5BanBnXkFtZTgwNzMyNzM2MzE@._V1_SX300.jpg"},{"title":"The Gray Mask","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Great Divide","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Greater Love Hath No Man","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Greater Will","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Gretna Green","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Heart of Jennifer","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Heart of Lincoln","year":1915,"description":"During the Civil War, a young man joins the Union army. His sweetheart's brother, on the other hand, joins the Confederate forces. During a battle the Confederate is captured and brought to...","rating":"N/A","poster":"N/A"},{"title":"The Heart of Maryland","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Heart of a Painted Woman","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Heart of the Blue Ridge","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Hearts and the Highway","year":1915,"description":"The Earl of Clanranald, obliged against his will to attend a meeting of conspirators against King James (II) of England, is arrested. His death warrant is signed by the King and dispatched ...","rating":"N/A","poster":"N/A"},{"title":"Hearts in Exile","year":1915,"description":"N/A","rating":"5.4","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTk3MjQ1N15BMl5BanBnXkFtZTYwMTQ3Mzc4._V1_SX300.jpg"},{"title":"The Heights of Hazard","year":1915,"description":"Miss Olivia Martindale, at a dinner, announces: \"There is no longer any romance in American life,\" and immediately arouses a storm of protest. Nevertheless, she describes to the assembled ...","rating":"N/A","poster":"N/A"},{"title":"Helene of the North","year":1915,"description":"N/A","rating":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BMTIwNzAwOTQ2OF5BMl5BanBnXkFtZTYwMTEzNzk5._V1_SX300.jpg"},{"title":"Help Wanted","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Her Great Match","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Her Mother's Secret","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Her Own Way","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Heritage","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The High Road","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"His Wife","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The House of Fear","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The House of Tears","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The House of a Thousand Candles","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The House of a Thousand Scandals","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The House of the Lost Court","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Hypocrites","year":1915},{"title":"I'm Glad My Boy Grew Up to Be a Soldier","year":1915,"description":"N/A","rating":"N/A","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAwZjRlZGMtNWYwZi00NDhjLTlhYWMtYTI2MzY1ZDRkMjFmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_SX300.jpg"},{"title":"The Immigrant","year":1915,"description":"N/A","rating":"7.8","poster":"N/A"},{"title":"The Impostor","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"In the Palace of the King","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Infatuation","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Inspiration","year":1915,"description":"A young sculptor searches for the perfect model to inspire his work.","rating":"7.4","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTRjMzM0MzAtZTI1Ny00MDVmLTk5ZjEtNmRkOWI5Mjk3Mzk3XkEyXkFqcGdeQXVyMjUwOTM1NTk@._V1_SX300.jpg"},{"title":"The Iron Strain","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Island of Regeneration","year":1915,"description":"N/A","rating":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BOGFmOWJjZjktODM2YS00MTk2LWFkYmYtZDZmZTk3OGZiZTVjXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_SX300.jpg"},{"title":"The Italian","year":1915,"description":"An immigrant leaves his sweetheart in Italy to find a better life across the sea in the grimy slums of New York. They are eventually reunited and marry. But life in New York is hard and ...","rating":"6.6","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjlkY2M2NDYtOWUxMS00YmVmLWFhZDUtMTNjZDEzNTQ0YWU3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_SX300.jpg"},{"title":"It's No Laughing Matter","year":1915,"description":"N/A","rating":"6.4","poster":"N/A"},{"title":"The Ivory Snuff Box","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Jane","year":1915,"description":"N/A","rating":"N/A","poster":"http://ia.media-imdb.com/images/M/MV5BNDkzY2EzODQtMjQ4Yi00NjY0LThkNmQtYmQxZTdjNDU1YmVhXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SX300.jpg"},{"title":"Jewel","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Jim the Penman","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"John Glayde's Honor","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Jordan Is a Hard Road","year":1915,"description":"A bandit reforms himself and gives up his baby into better hands. Years later, he attempts to reunite with his daughter without revealing who he is.","rating":"N/A","poster":"N/A"},{"title":"Judge Not","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Judy Forgot","year":1915,"description":"A woman who has been in a train wreck and lost her memory is mistaken for a vaudeville star, complete with a husband and several children.","rating":"N/A","poster":"N/A"},{"title":"The Juggernaut","year":1915,"description":"This silent film presents drama to prevent a train from falling from a damaged railroad bridge.","rating":"5.9","poster":"https://m.media-amazon.com/images/M/MV5BMjU5MjhmNGMtNzFmZS00ZjkwLTg5YWYtM2MwOWU4OTIwZTk5XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SX300.jpg"},{"title":"Just Jim","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Kilmeny","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Kindling","year":1915,"description":"Pregnant tenement dweller Maggie Schultz is being used by burglars and fears that though \"I stole to keep my baby from being born in this rat hole... now he's going to be born in jail.\" But the tenement owner may refuse to prosecute.","rating":"6.1","poster":"N/A"},{"title":"The Kreutzer Sonata","year":1915},{"title":"Lady Audley's Secret","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Lamb","year":1915,"description":"Gerald, the somewhat frail son of a wealthy New York family, is bested at the beach by Bill, a strapping young cowboy from Arizona. His fiancée Mary, ashamed of Gerald's \"yellow streak\", ...","rating":"6.0","poster":"N/A"},{"title":"The Lily and the Rose","year":1915,"description":"N/A","rating":"5.9","poster":"N/A"},{"title":"A Little Brother of the Rich","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Little Dutch Girl","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Little Gypsy","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Little Pal","year":1915,"description":"\"Little Pal\" is the daughter of a saloon keeper in a rough Alaskan gold rush town. During a game of dice, he loses his daughter to the brutal \"Black Brand\". A fight ensues and her father is...","rating":"N/A","poster":"N/A"},{"title":"The Long Chance","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Lord John in New York","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Love Route","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Luring Lights","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Lydia Gilmore","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Madame Butterfly","year":1915,"description":"The story of a Japanese woman and the tragedy that ensues when she loves an American naval officer.","rating":"5.3","poster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MjI4ODExOF5BMl5BanBnXkFtZTgwMzcwNzYwMjE@._V1_SX300.jpg"},{"title":"The Majesty of the Law","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Making Over of Geoffrey Manning","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Man Trail","year":1915,"description":"Young and athletic John Peabody is sick of city life and visits his uncle's lumber camp and is put to work, although his uncle will not recognize him as a nephew. But after John wins a ...","rating":"N/A","poster":"N/A"},{"title":"The Man of Shame","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Man Who Couldn't Beat God","year":1915,"description":"The son of a gardener on a millionaire's estate is treated cruelly by the wealthy man, and one day he strikes the boy across the face. Enraged, the young man kills his tormentor. He manages...","rating":"N/A","poster":"N/A"},{"title":"The Man Who Found Himself","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Marble Heart","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"The Marriage of Kitty","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Marrying Money","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"},{"title":"Marse Covington","year":1915,"description":"N/A","rating":"N/A","poster":"N/A"}]